/* automatically generated by rust-bindgen 0.72.1 */

pub const NGTCP2_MAX_CIDLEN: u32 = 20;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type socklen_t = __socklen_t;
pub type sa_family_t = ::std::os::raw::c_ushort;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct sockaddr {
    pub sa_family: sa_family_t,
    pub sa_data: [::std::os::raw::c_char; 14usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sockaddr"][::std::mem::size_of::<sockaddr>() - 16usize];
    ["Alignment of sockaddr"][::std::mem::align_of::<sockaddr>() - 2usize];
    ["Offset of field: sockaddr::sa_family"][::std::mem::offset_of!(sockaddr, sa_family) - 0usize];
    ["Offset of field: sockaddr::sa_data"][::std::mem::offset_of!(sockaddr, sa_data) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr_storage {
    pub ss_family: sa_family_t,
    pub __ss_padding: [::std::os::raw::c_char; 118usize],
    pub __ss_align: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sockaddr_storage"][::std::mem::size_of::<sockaddr_storage>() - 128usize];
    ["Alignment of sockaddr_storage"][::std::mem::align_of::<sockaddr_storage>() - 8usize];
    ["Offset of field: sockaddr_storage::ss_family"]
        [::std::mem::offset_of!(sockaddr_storage, ss_family) - 0usize];
    ["Offset of field: sockaddr_storage::__ss_padding"]
        [::std::mem::offset_of!(sockaddr_storage, __ss_padding) - 2usize];
    ["Offset of field: sockaddr_storage::__ss_align"]
        [::std::mem::offset_of!(sockaddr_storage, __ss_align) - 120usize];
};
impl Default for sockaddr_storage {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type in_addr_t = u32;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct in_addr {
    pub s_addr: in_addr_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of in_addr"][::std::mem::size_of::<in_addr>() - 4usize];
    ["Alignment of in_addr"][::std::mem::align_of::<in_addr>() - 4usize];
    ["Offset of field: in_addr::s_addr"][::std::mem::offset_of!(in_addr, s_addr) - 0usize];
};
pub type in_port_t = u16;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct in6_addr {
    pub __in6_u: in6_addr__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union in6_addr__bindgen_ty_1 {
    pub __u6_addr8: [u8; 16usize],
    pub __u6_addr16: [u16; 8usize],
    pub __u6_addr32: [u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of in6_addr__bindgen_ty_1"][::std::mem::size_of::<in6_addr__bindgen_ty_1>() - 16usize];
    ["Alignment of in6_addr__bindgen_ty_1"]
        [::std::mem::align_of::<in6_addr__bindgen_ty_1>() - 4usize];
    ["Offset of field: in6_addr__bindgen_ty_1::__u6_addr8"]
        [::std::mem::offset_of!(in6_addr__bindgen_ty_1, __u6_addr8) - 0usize];
    ["Offset of field: in6_addr__bindgen_ty_1::__u6_addr16"]
        [::std::mem::offset_of!(in6_addr__bindgen_ty_1, __u6_addr16) - 0usize];
    ["Offset of field: in6_addr__bindgen_ty_1::__u6_addr32"]
        [::std::mem::offset_of!(in6_addr__bindgen_ty_1, __u6_addr32) - 0usize];
};
impl Default for in6_addr__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of in6_addr"][::std::mem::size_of::<in6_addr>() - 16usize];
    ["Alignment of in6_addr"][::std::mem::align_of::<in6_addr>() - 4usize];
    ["Offset of field: in6_addr::__in6_u"][::std::mem::offset_of!(in6_addr, __in6_u) - 0usize];
};
impl Default for in6_addr {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct sockaddr_in {
    pub sin_family: sa_family_t,
    pub sin_port: in_port_t,
    pub sin_addr: in_addr,
    pub sin_zero: [::std::os::raw::c_uchar; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sockaddr_in"][::std::mem::size_of::<sockaddr_in>() - 16usize];
    ["Alignment of sockaddr_in"][::std::mem::align_of::<sockaddr_in>() - 4usize];
    ["Offset of field: sockaddr_in::sin_family"]
        [::std::mem::offset_of!(sockaddr_in, sin_family) - 0usize];
    ["Offset of field: sockaddr_in::sin_port"]
        [::std::mem::offset_of!(sockaddr_in, sin_port) - 2usize];
    ["Offset of field: sockaddr_in::sin_addr"]
        [::std::mem::offset_of!(sockaddr_in, sin_addr) - 4usize];
    ["Offset of field: sockaddr_in::sin_zero"]
        [::std::mem::offset_of!(sockaddr_in, sin_zero) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sockaddr_in6 {
    pub sin6_family: sa_family_t,
    pub sin6_port: in_port_t,
    pub sin6_flowinfo: u32,
    pub sin6_addr: in6_addr,
    pub sin6_scope_id: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sockaddr_in6"][::std::mem::size_of::<sockaddr_in6>() - 28usize];
    ["Alignment of sockaddr_in6"][::std::mem::align_of::<sockaddr_in6>() - 4usize];
    ["Offset of field: sockaddr_in6::sin6_family"]
        [::std::mem::offset_of!(sockaddr_in6, sin6_family) - 0usize];
    ["Offset of field: sockaddr_in6::sin6_port"]
        [::std::mem::offset_of!(sockaddr_in6, sin6_port) - 2usize];
    ["Offset of field: sockaddr_in6::sin6_flowinfo"]
        [::std::mem::offset_of!(sockaddr_in6, sin6_flowinfo) - 4usize];
    ["Offset of field: sockaddr_in6::sin6_addr"]
        [::std::mem::offset_of!(sockaddr_in6, sin6_addr) - 8usize];
    ["Offset of field: sockaddr_in6::sin6_scope_id"]
        [::std::mem::offset_of!(sockaddr_in6, sin6_scope_id) - 24usize];
};
impl Default for sockaddr_in6 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @functypedef\n\n :type:`ngtcp2_malloc` is a custom memory allocator to replace\n :manpage:`malloc(3)`.  The |user_data| is\n :member:`ngtcp2_mem.user_data`."]
pub type ngtcp2_malloc = ::std::option::Option<
    unsafe extern "C" fn(
        size: usize,
        user_data: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void,
>;
#[doc = " @functypedef\n\n :type:`ngtcp2_free` is a custom memory allocator to replace\n :manpage:`free(3)`.  The |user_data| is\n :member:`ngtcp2_mem.user_data`."]
pub type ngtcp2_free = ::std::option::Option<
    unsafe extern "C" fn(ptr: *mut ::std::os::raw::c_void, user_data: *mut ::std::os::raw::c_void),
>;
#[doc = " @functypedef\n\n :type:`ngtcp2_calloc` is a custom memory allocator to replace\n :manpage:`calloc(3)`.  The |user_data| is the\n :member:`ngtcp2_mem.user_data`."]
pub type ngtcp2_calloc = ::std::option::Option<
    unsafe extern "C" fn(
        nmemb: usize,
        size: usize,
        user_data: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void,
>;
#[doc = " @functypedef\n\n :type:`ngtcp2_realloc` is a custom memory allocator to replace\n :manpage:`realloc(3)`.  The |user_data| is the\n :member:`ngtcp2_mem.user_data`."]
pub type ngtcp2_realloc = ::std::option::Option<
    unsafe extern "C" fn(
        ptr: *mut ::std::os::raw::c_void,
        size: usize,
        user_data: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void,
>;
#[doc = " @struct\n\n :type:`ngtcp2_mem` is a custom memory allocator.  The\n :member:`user_data` field is passed to each allocator function.\n This can be used, for example, to achieve per-connection memory\n pool.\n\n In the following example code, ``my_malloc``, ``my_free``,\n ``my_calloc`` and ``my_realloc`` are the replacement of the\n standard allocators :manpage:`malloc(3)`, :manpage:`free(3)`,\n :manpage:`calloc(3)` and :manpage:`realloc(3)` respectively::\n\n     void *my_malloc_cb(size_t size, void *user_data) {\n       (void)user_data;\n       return my_malloc(size);\n     }\n\n     void my_free_cb(void *ptr, void *user_data) {\n       (void)user_data;\n       my_free(ptr);\n     }\n\n     void *my_calloc_cb(size_t nmemb, size_t size, void *user_data) {\n       (void)user_data;\n       return my_calloc(nmemb, size);\n     }\n\n     void *my_realloc_cb(void *ptr, size_t size, void *user_data) {\n       (void)user_data;\n       return my_realloc(ptr, size);\n     }\n\n     void conn_new() {\n       ngtcp2_mem mem = {NULL, my_malloc_cb, my_free_cb, my_calloc_cb,\n                          my_realloc_cb};\n\n       ...\n     }"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngtcp2_mem {
    #[doc = " :member:`user_data` is an arbitrary user supplied data.  This\n is passed to each allocator function."]
    pub user_data: *mut ::std::os::raw::c_void,
    #[doc = " :member:`malloc` is a custom allocator function to replace\n :manpage:`malloc(3)`."]
    pub malloc: ngtcp2_malloc,
    #[doc = " :member:`free` is a custom allocator function to replace\n :manpage:`free(3)`."]
    pub free: ngtcp2_free,
    #[doc = " :member:`calloc` is a custom allocator function to replace\n :manpage:`calloc(3)`."]
    pub calloc: ngtcp2_calloc,
    #[doc = " :member:`realloc` is a custom allocator function to replace\n :manpage:`realloc(3)`."]
    pub realloc: ngtcp2_realloc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngtcp2_mem"][::std::mem::size_of::<ngtcp2_mem>() - 40usize];
    ["Alignment of ngtcp2_mem"][::std::mem::align_of::<ngtcp2_mem>() - 8usize];
    ["Offset of field: ngtcp2_mem::user_data"]
        [::std::mem::offset_of!(ngtcp2_mem, user_data) - 0usize];
    ["Offset of field: ngtcp2_mem::malloc"][::std::mem::offset_of!(ngtcp2_mem, malloc) - 8usize];
    ["Offset of field: ngtcp2_mem::free"][::std::mem::offset_of!(ngtcp2_mem, free) - 16usize];
    ["Offset of field: ngtcp2_mem::calloc"][::std::mem::offset_of!(ngtcp2_mem, calloc) - 24usize];
    ["Offset of field: ngtcp2_mem::realloc"][::std::mem::offset_of!(ngtcp2_mem, realloc) - 32usize];
};
impl Default for ngtcp2_mem {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " :enum:`NGTCP2_PATH_VALIDATION_RESULT_SUCCESS` indicates\n successful validation."]
pub const ngtcp2_path_validation_result_NGTCP2_PATH_VALIDATION_RESULT_SUCCESS:
    ngtcp2_path_validation_result = 0;
#[doc = " :enum:`NGTCP2_PATH_VALIDATION_RESULT_FAILURE` indicates\n validation failure."]
pub const ngtcp2_path_validation_result_NGTCP2_PATH_VALIDATION_RESULT_FAILURE:
    ngtcp2_path_validation_result = 1;
#[doc = " :enum:`NGTCP2_PATH_VALIDATION_RESULT_ABORTED` indicates that path\n validation was aborted."]
pub const ngtcp2_path_validation_result_NGTCP2_PATH_VALIDATION_RESULT_ABORTED:
    ngtcp2_path_validation_result = 2;
#[doc = " @enum\n\n :type:`ngtcp2_path_validation_result` defines path validation\n result code."]
pub type ngtcp2_path_validation_result = ::std::os::raw::c_uint;
#[doc = " @typedef\n\n :type:`ngtcp2_tstamp` is a timestamp with nanosecond resolution.\n ``UINT64_MAX`` is an invalid value."]
pub type ngtcp2_tstamp = u64;
#[doc = " @typedef\n\n :type:`ngtcp2_duration` is a period of time in nanosecond\n resolution.  ``UINT64_MAX`` is an invalid value."]
pub type ngtcp2_duration = u64;
#[doc = " @struct\n\n :type:`ngtcp2_cid` holds a Connection ID."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ngtcp2_cid {
    #[doc = " :member:`datalen` is the length of Connection ID."]
    pub datalen: usize,
    #[doc = " :member:`data` is the buffer to store Connection ID."]
    pub data: [u8; 20usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngtcp2_cid"][::std::mem::size_of::<ngtcp2_cid>() - 32usize];
    ["Alignment of ngtcp2_cid"][::std::mem::align_of::<ngtcp2_cid>() - 8usize];
    ["Offset of field: ngtcp2_cid::datalen"][::std::mem::offset_of!(ngtcp2_cid, datalen) - 0usize];
    ["Offset of field: ngtcp2_cid::data"][::std::mem::offset_of!(ngtcp2_cid, data) - 8usize];
};
#[doc = " @struct\n\n :type:`ngtcp2_vec` is struct iovec compatible structure to\n reference arbitrary array of bytes."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngtcp2_vec {
    #[doc = " :member:`base` points to the data."]
    pub base: *mut u8,
    #[doc = " :member:`len` is the number of bytes which the buffer pointed by\n base contains."]
    pub len: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngtcp2_vec"][::std::mem::size_of::<ngtcp2_vec>() - 16usize];
    ["Alignment of ngtcp2_vec"][::std::mem::align_of::<ngtcp2_vec>() - 8usize];
    ["Offset of field: ngtcp2_vec::base"][::std::mem::offset_of!(ngtcp2_vec, base) - 0usize];
    ["Offset of field: ngtcp2_vec::len"][::std::mem::offset_of!(ngtcp2_vec, len) - 8usize];
};
impl Default for ngtcp2_vec {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @struct\n\n :type:`ngtcp2_pkt_hd` represents QUIC packet header."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngtcp2_pkt_hd {
    #[doc = " :member:`dcid` is Destination Connection ID."]
    pub dcid: ngtcp2_cid,
    #[doc = " :member:`scid` is Source Connection ID."]
    pub scid: ngtcp2_cid,
    #[doc = " :member:`pkt_num` is a packet number."]
    pub pkt_num: i64,
    #[doc = " :member:`token` contains token for Initial\n packet."]
    pub token: ngtcp2_vec,
    #[doc = " :member:`pkt_numlen` is the number of bytes spent to encode\n :member:`pkt_num`."]
    pub pkt_numlen: usize,
    #[doc = " :member:`len` is the sum of :member:`pkt_numlen` and the length\n of QUIC packet payload."]
    pub len: usize,
    #[doc = " :member:`version` is QUIC version."]
    pub version: u32,
    #[doc = " :member:`type` is a type of QUIC packet.  See\n :type:`ngtcp2_pkt_type`."]
    pub type_: u8,
    #[doc = " :member:`flags` is zero or more of :macro:`NGTCP2_PKT_FLAG_*\n <NGTCP2_PKT_FLAG_NONE>`."]
    pub flags: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngtcp2_pkt_hd"][::std::mem::size_of::<ngtcp2_pkt_hd>() - 112usize];
    ["Alignment of ngtcp2_pkt_hd"][::std::mem::align_of::<ngtcp2_pkt_hd>() - 8usize];
    ["Offset of field: ngtcp2_pkt_hd::dcid"][::std::mem::offset_of!(ngtcp2_pkt_hd, dcid) - 0usize];
    ["Offset of field: ngtcp2_pkt_hd::scid"][::std::mem::offset_of!(ngtcp2_pkt_hd, scid) - 32usize];
    ["Offset of field: ngtcp2_pkt_hd::pkt_num"]
        [::std::mem::offset_of!(ngtcp2_pkt_hd, pkt_num) - 64usize];
    ["Offset of field: ngtcp2_pkt_hd::token"]
        [::std::mem::offset_of!(ngtcp2_pkt_hd, token) - 72usize];
    ["Offset of field: ngtcp2_pkt_hd::pkt_numlen"]
        [::std::mem::offset_of!(ngtcp2_pkt_hd, pkt_numlen) - 88usize];
    ["Offset of field: ngtcp2_pkt_hd::len"][::std::mem::offset_of!(ngtcp2_pkt_hd, len) - 96usize];
    ["Offset of field: ngtcp2_pkt_hd::version"]
        [::std::mem::offset_of!(ngtcp2_pkt_hd, version) - 104usize];
    ["Offset of field: ngtcp2_pkt_hd::type_"]
        [::std::mem::offset_of!(ngtcp2_pkt_hd, type_) - 108usize];
    ["Offset of field: ngtcp2_pkt_hd::flags"]
        [::std::mem::offset_of!(ngtcp2_pkt_hd, flags) - 109usize];
};
impl Default for ngtcp2_pkt_hd {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @struct\n\n :type:`ngtcp2_pkt_stateless_reset` represents Stateless Reset."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngtcp2_pkt_stateless_reset {
    #[doc = " :member:`stateless_reset_token` contains stateless reset token."]
    pub stateless_reset_token: [u8; 16usize],
    #[doc = " :member:`rand` points a buffer which contains random bytes\n section."]
    pub rand: *const u8,
    #[doc = " :member:`randlen` is the number of random bytes."]
    pub randlen: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngtcp2_pkt_stateless_reset"]
        [::std::mem::size_of::<ngtcp2_pkt_stateless_reset>() - 32usize];
    ["Alignment of ngtcp2_pkt_stateless_reset"]
        [::std::mem::align_of::<ngtcp2_pkt_stateless_reset>() - 8usize];
    ["Offset of field: ngtcp2_pkt_stateless_reset::stateless_reset_token"]
        [::std::mem::offset_of!(ngtcp2_pkt_stateless_reset, stateless_reset_token) - 0usize];
    ["Offset of field: ngtcp2_pkt_stateless_reset::rand"]
        [::std::mem::offset_of!(ngtcp2_pkt_stateless_reset, rand) - 16usize];
    ["Offset of field: ngtcp2_pkt_stateless_reset::randlen"]
        [::std::mem::offset_of!(ngtcp2_pkt_stateless_reset, randlen) - 24usize];
};
impl Default for ngtcp2_pkt_stateless_reset {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " :enum:`NGTCP2_TRANSPORT_PARAMS_TYPE_CLIENT_HELLO` is Client Hello\n TLS message."]
pub const ngtcp2_transport_params_type_NGTCP2_TRANSPORT_PARAMS_TYPE_CLIENT_HELLO:
    ngtcp2_transport_params_type = 0;
#[doc = " :enum:`NGTCP2_TRANSPORT_PARAMS_TYPE_ENCRYPTED_EXTENSIONS` is\n Encrypted Extensions TLS message."]
pub const ngtcp2_transport_params_type_NGTCP2_TRANSPORT_PARAMS_TYPE_ENCRYPTED_EXTENSIONS:
    ngtcp2_transport_params_type = 1;
#[doc = " @enum\n\n :type:`ngtcp2_transport_params_type` defines TLS message type which\n carries transport parameters."]
pub type ngtcp2_transport_params_type = ::std::os::raw::c_uint;
#[doc = " @typedef\n\n :type:`ngtcp2_sockaddr` is typedefed to struct sockaddr.  If\n :macro:`NGTCP2_USE_GENERIC_SOCKADDR` is defined, it is typedefed to\n the generic struct sockaddr defined in ngtcp2.h."]
pub type ngtcp2_sockaddr = sockaddr;
#[doc = " @typedef\n\n :type:`ngtcp2_sockaddr_in` is typedefed to struct sockaddr_in.  If\n :macro:`NGTCP2_USE_GENERIC_SOCKADDR` is defined, it is typedefed to\n the generic struct sockaddr_in defined in ngtcp2.h."]
pub type ngtcp2_sockaddr_in = sockaddr_in;
#[doc = " @typedef\n\n :type:`ngtcp2_socklen` is typedefed to socklen_t.  If\n :macro:`NGTCP2_USE_GENERIC_SOCKADDR` is defined, it is typedefed to\n uint32_t."]
pub type ngtcp2_socklen = socklen_t;
#[doc = " @typedef\n\n :type:`ngtcp2_sockaddr_in6` is typedefed to struct sockaddr_in6.\n If :macro:`NGTCP2_USE_GENERIC_SOCKADDR` is defined, it is typedefed\n to the generic struct sockaddr_in6 defined in ngtcp2.h."]
pub type ngtcp2_sockaddr_in6 = sockaddr_in6;
#[doc = " @struct\n\n :type:`ngtcp2_preferred_addr` represents preferred address\n structure."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ngtcp2_preferred_addr {
    #[doc = " :member:`cid` is a Connection ID."]
    pub cid: ngtcp2_cid,
    #[doc = " :member:`ipv4` contains IPv4 address and port."]
    pub ipv4: ngtcp2_sockaddr_in,
    #[doc = " :member:`ipv6` contains IPv4 address and port."]
    pub ipv6: ngtcp2_sockaddr_in6,
    #[doc = " :member:`ipv4_present` indicates that :member:`ipv4` contains\n IPv4 address and port."]
    pub ipv4_present: u8,
    #[doc = " :member:`ipv6_present` indicates that :member:`ipv6` contains\n IPv6 address and port."]
    pub ipv6_present: u8,
    #[doc = " :member:`stateless_reset_token` contains stateless reset token."]
    pub stateless_reset_token: [u8; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngtcp2_preferred_addr"][::std::mem::size_of::<ngtcp2_preferred_addr>() - 96usize];
    ["Alignment of ngtcp2_preferred_addr"]
        [::std::mem::align_of::<ngtcp2_preferred_addr>() - 8usize];
    ["Offset of field: ngtcp2_preferred_addr::cid"]
        [::std::mem::offset_of!(ngtcp2_preferred_addr, cid) - 0usize];
    ["Offset of field: ngtcp2_preferred_addr::ipv4"]
        [::std::mem::offset_of!(ngtcp2_preferred_addr, ipv4) - 32usize];
    ["Offset of field: ngtcp2_preferred_addr::ipv6"]
        [::std::mem::offset_of!(ngtcp2_preferred_addr, ipv6) - 48usize];
    ["Offset of field: ngtcp2_preferred_addr::ipv4_present"]
        [::std::mem::offset_of!(ngtcp2_preferred_addr, ipv4_present) - 76usize];
    ["Offset of field: ngtcp2_preferred_addr::ipv6_present"]
        [::std::mem::offset_of!(ngtcp2_preferred_addr, ipv6_present) - 77usize];
    ["Offset of field: ngtcp2_preferred_addr::stateless_reset_token"]
        [::std::mem::offset_of!(ngtcp2_preferred_addr, stateless_reset_token) - 78usize];
};
impl Default for ngtcp2_preferred_addr {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @struct\n\n :type:`ngtcp2_version_info` represents version_information\n structure."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngtcp2_version_info {
    #[doc = " :member:`chosen_version` is the version chosen by the sender."]
    pub chosen_version: u32,
    #[doc = " :member:`other_versions` points the wire image of other_versions\n field.  The each version is therefore in network byte order."]
    pub other_versions: *mut u8,
    #[doc = " :member:`other_versionslen` is the number of bytes pointed by\n :member:`other_versions`, not the number of versions included."]
    pub other_versionslen: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngtcp2_version_info"][::std::mem::size_of::<ngtcp2_version_info>() - 24usize];
    ["Alignment of ngtcp2_version_info"][::std::mem::align_of::<ngtcp2_version_info>() - 8usize];
    ["Offset of field: ngtcp2_version_info::chosen_version"]
        [::std::mem::offset_of!(ngtcp2_version_info, chosen_version) - 0usize];
    ["Offset of field: ngtcp2_version_info::other_versions"]
        [::std::mem::offset_of!(ngtcp2_version_info, other_versions) - 8usize];
    ["Offset of field: ngtcp2_version_info::other_versionslen"]
        [::std::mem::offset_of!(ngtcp2_version_info, other_versionslen) - 16usize];
};
impl Default for ngtcp2_version_info {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @struct\n\n :type:`ngtcp2_transport_params` represents QUIC transport\n parameters."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ngtcp2_transport_params {
    #[doc = " :member:`preferred_address` contains preferred address if\n :member:`preferred_address_present` is nonzero."]
    pub preferred_address: ngtcp2_preferred_addr,
    #[doc = " :member:`original_dcid` is the Destination Connection ID field\n from the first Initial packet from client.  Server must specify\n this field.  It is expected that application knows the original\n Destination Connection ID even if it sends Retry packet, for\n example, by including it in retry token.  Otherwise, application\n should not specify this field."]
    pub original_dcid: ngtcp2_cid,
    #[doc = " :member:`initial_scid` is the Source Connection ID field from the\n first Initial packet the endpoint sends.  Application should not\n specify this field."]
    pub initial_scid: ngtcp2_cid,
    #[doc = " :member:`retry_scid` is the Source Connection ID field from Retry\n packet.  Only server uses this field.  If server application\n received Initial packet with retry token from client and server\n verified its token, server application must set Destination\n Connection ID field from the Initial packet to this field and set\n :member:`retry_scid_present` to nonzero.  Server application must\n verify that the Destination Connection ID from Initial packet was\n sent in Retry packet by, for example, including the Connection ID\n in a token, or including it in AAD when encrypting a token."]
    pub retry_scid: ngtcp2_cid,
    #[doc = " :member:`initial_max_stream_data_bidi_local` is the size of flow\n control window of locally initiated stream.  This is the number\n of bytes that the remote endpoint can send and the local endpoint\n must ensure that it has enough buffer to receive them."]
    pub initial_max_stream_data_bidi_local: u64,
    #[doc = " :member:`initial_max_stream_data_bidi_remote` is the size of flow\n control window of remotely initiated stream.  This is the number\n of bytes that the remote endpoint can send and the local endpoint\n must ensure that it has enough buffer to receive them."]
    pub initial_max_stream_data_bidi_remote: u64,
    #[doc = " :member:`initial_max_stream_data_uni` is the size of flow control\n window of remotely initiated unidirectional stream.  This is the\n number of bytes that the remote endpoint can send and the local\n endpoint must ensure that it has enough buffer to receive them."]
    pub initial_max_stream_data_uni: u64,
    #[doc = " :member:`initial_max_data` is the connection level flow control\n window."]
    pub initial_max_data: u64,
    #[doc = " :member:`initial_max_streams_bidi` is the number of concurrent\n streams that the remote endpoint can create."]
    pub initial_max_streams_bidi: u64,
    #[doc = " :member:`initial_max_streams_uni` is the number of concurrent\n unidirectional streams that the remote endpoint can create."]
    pub initial_max_streams_uni: u64,
    #[doc = " :member:`max_idle_timeout` is a duration during which sender\n allows quiescent."]
    pub max_idle_timeout: ngtcp2_duration,
    #[doc = " :member:`max_udp_payload_size` is the maximum datagram size that\n the endpoint can receive."]
    pub max_udp_payload_size: u64,
    #[doc = " :member:`active_connection_id_limit` is the maximum number of\n Connection ID that sender can store."]
    pub active_connection_id_limit: u64,
    #[doc = " :member:`ack_delay_exponent` is the exponent used in ACK Delay\n field in ACK frame."]
    pub ack_delay_exponent: u64,
    #[doc = " :member:`max_ack_delay` is the maximum acknowledgement delay by\n which the endpoint will delay sending acknowledgements."]
    pub max_ack_delay: ngtcp2_duration,
    #[doc = " :member:`max_datagram_frame_size` is the maximum size of DATAGRAM\n frame that this endpoint willingly receives.  Specifying 0\n disables DATAGRAM support.  See\n https://datatracker.ietf.org/doc/html/rfc9221"]
    pub max_datagram_frame_size: u64,
    #[doc = " :member:`stateless_reset_token_present` is nonzero if\n :member:`stateless_reset_token` field is set."]
    pub stateless_reset_token_present: u8,
    #[doc = " :member:`disable_active_migration` is nonzero if the endpoint\n does not support active connection migration."]
    pub disable_active_migration: u8,
    #[doc = " :member:`retry_scid_present` is nonzero if :member:`retry_scid`\n field is set."]
    pub retry_scid_present: u8,
    #[doc = " :member:`preferred_address_present` is nonzero if\n :member:`preferred_address` is set."]
    pub preferred_address_present: u8,
    #[doc = " :member:`stateless_reset_token` contains stateless reset token."]
    pub stateless_reset_token: [u8; 16usize],
    #[doc = " :member:`grease_quic_bit` is nonzero if sender supports \"Greasing\n the QUIC Bit\" extension.  See :rfc:`9287`.  Note that the local\n endpoint always enables greasing QUIC bit regardless of this\n field value."]
    pub grease_quic_bit: u8,
    #[doc = " :member:`version_info` contains version_information field if\n :member:`version_info_present` is nonzero.  Application should\n not specify this field."]
    pub version_info: ngtcp2_version_info,
    #[doc = " :member:`version_info_present` is nonzero if\n :member:`version_info` is set.  Application should not specify\n this field."]
    pub version_info_present: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngtcp2_transport_params"]
        [::std::mem::size_of::<ngtcp2_transport_params>() - 344usize];
    ["Alignment of ngtcp2_transport_params"]
        [::std::mem::align_of::<ngtcp2_transport_params>() - 8usize];
    ["Offset of field: ngtcp2_transport_params::preferred_address"]
        [::std::mem::offset_of!(ngtcp2_transport_params, preferred_address) - 0usize];
    ["Offset of field: ngtcp2_transport_params::original_dcid"]
        [::std::mem::offset_of!(ngtcp2_transport_params, original_dcid) - 96usize];
    ["Offset of field: ngtcp2_transport_params::initial_scid"]
        [::std::mem::offset_of!(ngtcp2_transport_params, initial_scid) - 128usize];
    ["Offset of field: ngtcp2_transport_params::retry_scid"]
        [::std::mem::offset_of!(ngtcp2_transport_params, retry_scid) - 160usize];
    ["Offset of field: ngtcp2_transport_params::initial_max_stream_data_bidi_local"][::std::mem::offset_of!(
        ngtcp2_transport_params,
        initial_max_stream_data_bidi_local
    ) - 192usize];
    ["Offset of field: ngtcp2_transport_params::initial_max_stream_data_bidi_remote"][::std::mem::offset_of!(
        ngtcp2_transport_params,
        initial_max_stream_data_bidi_remote
    ) - 200usize];
    ["Offset of field: ngtcp2_transport_params::initial_max_stream_data_uni"]
        [::std::mem::offset_of!(ngtcp2_transport_params, initial_max_stream_data_uni) - 208usize];
    ["Offset of field: ngtcp2_transport_params::initial_max_data"]
        [::std::mem::offset_of!(ngtcp2_transport_params, initial_max_data) - 216usize];
    ["Offset of field: ngtcp2_transport_params::initial_max_streams_bidi"]
        [::std::mem::offset_of!(ngtcp2_transport_params, initial_max_streams_bidi) - 224usize];
    ["Offset of field: ngtcp2_transport_params::initial_max_streams_uni"]
        [::std::mem::offset_of!(ngtcp2_transport_params, initial_max_streams_uni) - 232usize];
    ["Offset of field: ngtcp2_transport_params::max_idle_timeout"]
        [::std::mem::offset_of!(ngtcp2_transport_params, max_idle_timeout) - 240usize];
    ["Offset of field: ngtcp2_transport_params::max_udp_payload_size"]
        [::std::mem::offset_of!(ngtcp2_transport_params, max_udp_payload_size) - 248usize];
    ["Offset of field: ngtcp2_transport_params::active_connection_id_limit"]
        [::std::mem::offset_of!(ngtcp2_transport_params, active_connection_id_limit) - 256usize];
    ["Offset of field: ngtcp2_transport_params::ack_delay_exponent"]
        [::std::mem::offset_of!(ngtcp2_transport_params, ack_delay_exponent) - 264usize];
    ["Offset of field: ngtcp2_transport_params::max_ack_delay"]
        [::std::mem::offset_of!(ngtcp2_transport_params, max_ack_delay) - 272usize];
    ["Offset of field: ngtcp2_transport_params::max_datagram_frame_size"]
        [::std::mem::offset_of!(ngtcp2_transport_params, max_datagram_frame_size) - 280usize];
    ["Offset of field: ngtcp2_transport_params::stateless_reset_token_present"]
        [::std::mem::offset_of!(ngtcp2_transport_params, stateless_reset_token_present) - 288usize];
    ["Offset of field: ngtcp2_transport_params::disable_active_migration"]
        [::std::mem::offset_of!(ngtcp2_transport_params, disable_active_migration) - 289usize];
    ["Offset of field: ngtcp2_transport_params::retry_scid_present"]
        [::std::mem::offset_of!(ngtcp2_transport_params, retry_scid_present) - 290usize];
    ["Offset of field: ngtcp2_transport_params::preferred_address_present"]
        [::std::mem::offset_of!(ngtcp2_transport_params, preferred_address_present) - 291usize];
    ["Offset of field: ngtcp2_transport_params::stateless_reset_token"]
        [::std::mem::offset_of!(ngtcp2_transport_params, stateless_reset_token) - 292usize];
    ["Offset of field: ngtcp2_transport_params::grease_quic_bit"]
        [::std::mem::offset_of!(ngtcp2_transport_params, grease_quic_bit) - 308usize];
    ["Offset of field: ngtcp2_transport_params::version_info"]
        [::std::mem::offset_of!(ngtcp2_transport_params, version_info) - 312usize];
    ["Offset of field: ngtcp2_transport_params::version_info_present"]
        [::std::mem::offset_of!(ngtcp2_transport_params, version_info_present) - 336usize];
};
impl Default for ngtcp2_transport_params {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " :enum:`NGTCP2_CC_ALGO_RENO` represents Reno."]
pub const ngtcp2_cc_algo_NGTCP2_CC_ALGO_RENO: ngtcp2_cc_algo = 0;
#[doc = " :enum:`NGTCP2_CC_ALGO_CUBIC` represents Cubic."]
pub const ngtcp2_cc_algo_NGTCP2_CC_ALGO_CUBIC: ngtcp2_cc_algo = 1;
#[doc = " :enum:`NGTCP2_CC_ALGO_BBR` represents BBR."]
pub const ngtcp2_cc_algo_NGTCP2_CC_ALGO_BBR: ngtcp2_cc_algo = 2;
#[doc = " :enum:`NGTCP2_CC_ALGO_BBR2` represents BBR v2."]
pub const ngtcp2_cc_algo_NGTCP2_CC_ALGO_BBR2: ngtcp2_cc_algo = 3;
#[doc = " @enum\n\n :type:`ngtcp2_cc_algo` defines congestion control algorithms."]
pub type ngtcp2_cc_algo = ::std::os::raw::c_uint;
#[doc = " @functypedef\n\n :type:`ngtcp2_printf` is a callback function for logging.\n |user_data| is the same object passed to `ngtcp2_conn_client_new`\n or `ngtcp2_conn_server_new`."]
pub type ngtcp2_printf = ::std::option::Option<
    unsafe extern "C" fn(
        user_data: *mut ::std::os::raw::c_void,
        format: *const ::std::os::raw::c_char,
        ...
    ),
>;
#[doc = " @struct\n\n :type:`ngtcp2_rand_ctx` is a wrapper around native random number\n generator.  It is opaque to the ngtcp2 library.  This might be\n useful if application needs to specify random number generator per\n thread or per connection."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngtcp2_rand_ctx {
    #[doc = " :member:`native_handle` is a pointer to an underlying random\n number generator."]
    pub native_handle: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngtcp2_rand_ctx"][::std::mem::size_of::<ngtcp2_rand_ctx>() - 8usize];
    ["Alignment of ngtcp2_rand_ctx"][::std::mem::align_of::<ngtcp2_rand_ctx>() - 8usize];
    ["Offset of field: ngtcp2_rand_ctx::native_handle"]
        [::std::mem::offset_of!(ngtcp2_rand_ctx, native_handle) - 0usize];
};
impl Default for ngtcp2_rand_ctx {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @functypedef\n\n :type:`ngtcp2_qlog_write` is a callback function which is called to\n write qlog |data| of length |datalen| bytes.  |flags| is bitwise OR\n of zero or more of :macro:`NGTCP2_QLOG_WRITE_FLAG_*\n <NGTCP2_QLOG_WRITE_FLAG_NONE>`.  If\n :macro:`NGTCP2_QLOG_WRITE_FLAG_FIN` is set, |datalen| may be 0."]
pub type ngtcp2_qlog_write = ::std::option::Option<
    unsafe extern "C" fn(
        user_data: *mut ::std::os::raw::c_void,
        flags: u32,
        data: *const ::std::os::raw::c_void,
        datalen: usize,
    ),
>;
#[doc = " @struct\n\n :type:`ngtcp2_qlog_settings` is a set of settings for qlog."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ngtcp2_qlog_settings {
    #[doc = " :member:`odcid` is Original Destination Connection ID sent by\n client.  It is used as group_id and ODCID fields.  Client ignores\n this field and uses dcid parameter passed to\n `ngtcp2_conn_client_new()`."]
    pub odcid: ngtcp2_cid,
    #[doc = " :member:`write` is a callback function to write qlog.  Setting\n ``NULL`` disables qlog."]
    pub write: ngtcp2_qlog_write,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngtcp2_qlog_settings"][::std::mem::size_of::<ngtcp2_qlog_settings>() - 40usize];
    ["Alignment of ngtcp2_qlog_settings"][::std::mem::align_of::<ngtcp2_qlog_settings>() - 8usize];
    ["Offset of field: ngtcp2_qlog_settings::odcid"]
        [::std::mem::offset_of!(ngtcp2_qlog_settings, odcid) - 0usize];
    ["Offset of field: ngtcp2_qlog_settings::write"]
        [::std::mem::offset_of!(ngtcp2_qlog_settings, write) - 32usize];
};
#[doc = " @struct\n\n :type:`ngtcp2_settings` defines QUIC connection settings."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngtcp2_settings {
    #[doc = " :member:`qlog` is qlog settings."]
    pub qlog: ngtcp2_qlog_settings,
    #[doc = " :member:`cc_algo` specifies congestion control algorithm."]
    pub cc_algo: ngtcp2_cc_algo,
    #[doc = " :member:`initial_ts` is an initial timestamp given to the\n library."]
    pub initial_ts: ngtcp2_tstamp,
    #[doc = " :member:`initial_rtt` is an initial RTT."]
    pub initial_rtt: ngtcp2_duration,
    #[doc = " :member:`log_printf` is a function that the library uses to write\n logs.  ``NULL`` means no logging output.  It is nothing to do\n with qlog."]
    pub log_printf: ngtcp2_printf,
    #[doc = " :member:`max_tx_udp_payload_size` is the maximum size of UDP\n datagram payload that this endpoint transmits.  It is used by\n congestion controller to compute congestion window."]
    pub max_tx_udp_payload_size: usize,
    #[doc = " :member:`token` is a token from Retry packet or NEW_TOKEN frame.\n\n Server sets this field if it received the token in Client Initial\n packet and successfully validated.\n\n Client sets this field if it intends to send token in its Initial\n packet.\n\n `ngtcp2_conn_server_new` and `ngtcp2_conn_client_new` make a copy\n of token."]
    pub token: ngtcp2_vec,
    #[doc = " :member:`rand_ctx` is an optional random number generator to be\n passed to :type:`ngtcp2_rand` callback."]
    pub rand_ctx: ngtcp2_rand_ctx,
    #[doc = " :member:`max_window` is the maximum connection-level flow control\n window if connection-level window auto-tuning is enabled.  The\n connection-level window auto tuning is enabled if nonzero value\n is specified in this field.  The initial value of window size is\n :member:`ngtcp2_transport_params.initial_max_data`.  The window\n size is scaled up to the value specified in this field."]
    pub max_window: u64,
    #[doc = " :member:`max_stream_window` is the maximum stream-level flow\n control window if stream-level window auto-tuning is enabled.\n The stream-level window auto-tuning is enabled if nonzero value\n is specified in this field.  The initial value of window size is\n :member:`ngtcp2_transport_params.initial_max_stream_data_bidi_remote`,\n :member:`ngtcp2_transport_params.initial_max_stream_data_bidi_local`,\n or :member:`ngtcp2_transport_params.initial_max_stream_data_uni`,\n depending on the type of stream.  The window size is scaled up to\n the value specified in this field."]
    pub max_stream_window: u64,
    #[doc = " :member:`ack_thresh` is the minimum number of the received ACK\n eliciting packets that triggers the immediate acknowledgement."]
    pub ack_thresh: usize,
    #[doc = " :member:`no_tx_udp_payload_size_shaping`, if set to nonzero,\n instructs the library not to limit the UDP payload size to\n :macro:`NGTCP2_MAX_UDP_PAYLOAD_SIZE` (which can be extended by\n Path MTU Discovery) and instead use the mininum size among the\n given buffer size, :member:`max_tx_udp_payload_size`, and the\n received max_udp_payload QUIC transport parameter."]
    pub no_tx_udp_payload_size_shaping: ::std::os::raw::c_int,
    #[doc = " :member:`handshake_timeout` is the period of time before giving\n up QUIC connection establishment.  If QUIC handshake is not\n complete within this period, `ngtcp2_conn_handle_expiry` returns\n :macro:`NGTCP2_ERR_HANDSHAKE_TIMEOUT` error.  The deadline is\n :member:`initial_ts` + :member:`handshake_timeout`.  If this\n field is set to ``UINT64_MAX``, no handshake timeout is set."]
    pub handshake_timeout: ngtcp2_duration,
    #[doc = " :member:`preferred_versions` is the array of versions that are\n preferred by the local endpoint.  All versions set in this array\n must be supported by the library, and compatible to QUIC v1.  The\n reserved versions are not allowed.  They are sorted in the order\n of preference.\n\n On compatible version negotiation, server will negotiate one of\n those versions contained in this array if a client initially\n chooses a less preferred version.  This version set corresponds\n to Offered Versions in QUIC Version Negotiation draft, and it should\n be sent in Version Negotiation packet.\n\n Client uses this field and :member:`original_version` to prevent\n version downgrade attack if it reacted upon Version Negotiation\n packet.  If this field is specified, client must include\n |client_chosen_version| passed to `ngtcp2_conn_client_new` unless\n |client_chosen_version| is a reserved version."]
    pub preferred_versions: *mut u32,
    #[doc = " :member:`preferred_versionslen` is the number of versions that\n are contained in the array pointed by\n :member:`preferred_versions`."]
    pub preferred_versionslen: usize,
    #[doc = " :member:`other_versions` is the array of versions that are set in\n :member:`other_versions <ngtcp2_version_info.other_versions>`\n field of outgoing version_information QUIC transport parameter.\n\n For server, this corresponds to Fully-Deployed Versions in QUIC\n Version Negotiation draft.  If this field is set not, it is set\n to :member:`preferred_versions` internally if\n :member:`preferred_versionslen` is not zero.  If this field is\n not set, and :member:`preferred_versionslen` is zero, this field\n is set to :macro:`NGTCP2_PROTO_VER_V1` internally.\n\n Client must include |client_chosen_version| passed to\n `ngtcp2_conn_client_new` in this array if this field is set and\n |client_chosen_version| is not a reserved version.  If this field\n is not set, |client_chosen_version| passed to\n `ngtcp2_conn_client_new` will be set in this field internally\n unless |client_chosen_version| is a reserved version."]
    pub other_versions: *mut u32,
    #[doc = " :member:`other_versionslen` is the number of versions that are\n contained in the array pointed by :member:`other_versions`."]
    pub other_versionslen: usize,
    #[doc = " :member:`original_version` is the original version that client\n initially used to make a connection attempt.  If it is set, and\n it differs from |client_chosen_version| passed to\n `ngtcp2_conn_client_new`, the library assumes that client reacted\n upon Version Negotiation packet.  Server does not use this field."]
    pub original_version: u32,
    #[doc = " :member:`no_pmtud`, if set to nonzero, disables Path MTU\n Discovery."]
    pub no_pmtud: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngtcp2_settings"][::std::mem::size_of::<ngtcp2_settings>() - 184usize];
    ["Alignment of ngtcp2_settings"][::std::mem::align_of::<ngtcp2_settings>() - 8usize];
    ["Offset of field: ngtcp2_settings::qlog"]
        [::std::mem::offset_of!(ngtcp2_settings, qlog) - 0usize];
    ["Offset of field: ngtcp2_settings::cc_algo"]
        [::std::mem::offset_of!(ngtcp2_settings, cc_algo) - 40usize];
    ["Offset of field: ngtcp2_settings::initial_ts"]
        [::std::mem::offset_of!(ngtcp2_settings, initial_ts) - 48usize];
    ["Offset of field: ngtcp2_settings::initial_rtt"]
        [::std::mem::offset_of!(ngtcp2_settings, initial_rtt) - 56usize];
    ["Offset of field: ngtcp2_settings::log_printf"]
        [::std::mem::offset_of!(ngtcp2_settings, log_printf) - 64usize];
    ["Offset of field: ngtcp2_settings::max_tx_udp_payload_size"]
        [::std::mem::offset_of!(ngtcp2_settings, max_tx_udp_payload_size) - 72usize];
    ["Offset of field: ngtcp2_settings::token"]
        [::std::mem::offset_of!(ngtcp2_settings, token) - 80usize];
    ["Offset of field: ngtcp2_settings::rand_ctx"]
        [::std::mem::offset_of!(ngtcp2_settings, rand_ctx) - 96usize];
    ["Offset of field: ngtcp2_settings::max_window"]
        [::std::mem::offset_of!(ngtcp2_settings, max_window) - 104usize];
    ["Offset of field: ngtcp2_settings::max_stream_window"]
        [::std::mem::offset_of!(ngtcp2_settings, max_stream_window) - 112usize];
    ["Offset of field: ngtcp2_settings::ack_thresh"]
        [::std::mem::offset_of!(ngtcp2_settings, ack_thresh) - 120usize];
    ["Offset of field: ngtcp2_settings::no_tx_udp_payload_size_shaping"]
        [::std::mem::offset_of!(ngtcp2_settings, no_tx_udp_payload_size_shaping) - 128usize];
    ["Offset of field: ngtcp2_settings::handshake_timeout"]
        [::std::mem::offset_of!(ngtcp2_settings, handshake_timeout) - 136usize];
    ["Offset of field: ngtcp2_settings::preferred_versions"]
        [::std::mem::offset_of!(ngtcp2_settings, preferred_versions) - 144usize];
    ["Offset of field: ngtcp2_settings::preferred_versionslen"]
        [::std::mem::offset_of!(ngtcp2_settings, preferred_versionslen) - 152usize];
    ["Offset of field: ngtcp2_settings::other_versions"]
        [::std::mem::offset_of!(ngtcp2_settings, other_versions) - 160usize];
    ["Offset of field: ngtcp2_settings::other_versionslen"]
        [::std::mem::offset_of!(ngtcp2_settings, other_versionslen) - 168usize];
    ["Offset of field: ngtcp2_settings::original_version"]
        [::std::mem::offset_of!(ngtcp2_settings, original_version) - 176usize];
    ["Offset of field: ngtcp2_settings::no_pmtud"]
        [::std::mem::offset_of!(ngtcp2_settings, no_pmtud) - 180usize];
};
impl Default for ngtcp2_settings {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @struct\n\n :type:`ngtcp2_addr` is the endpoint address."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngtcp2_addr {
    #[doc = " :member:`addr` points to the buffer which contains endpoint\n address.  It must not be ``NULL``."]
    pub addr: *mut ngtcp2_sockaddr,
    #[doc = " :member:`addrlen` is the length of addr."]
    pub addrlen: ngtcp2_socklen,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngtcp2_addr"][::std::mem::size_of::<ngtcp2_addr>() - 16usize];
    ["Alignment of ngtcp2_addr"][::std::mem::align_of::<ngtcp2_addr>() - 8usize];
    ["Offset of field: ngtcp2_addr::addr"][::std::mem::offset_of!(ngtcp2_addr, addr) - 0usize];
    ["Offset of field: ngtcp2_addr::addrlen"]
        [::std::mem::offset_of!(ngtcp2_addr, addrlen) - 8usize];
};
impl Default for ngtcp2_addr {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @struct\n\n :type:`ngtcp2_path` is the network endpoints where a packet is sent\n and received."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngtcp2_path {
    #[doc = " :member:`local` is the address of local endpoint."]
    pub local: ngtcp2_addr,
    #[doc = " :member:`remote` is the address of remote endpoint."]
    pub remote: ngtcp2_addr,
    #[doc = " :member:`user_data` is an arbitrary data and opaque to the\n library.\n\n Note that :type:`ngtcp2_path` is generally passed to\n :type:`ngtcp2_conn` by an application, and :type:`ngtcp2_conn`\n stores their copies.  Unfortunately, there is no way for the\n application to know when :type:`ngtcp2_conn` finishes using a\n specific :type:`ngtcp2_path` object in mid connection, which\n means that the application cannot free the data pointed by this\n field.  Therefore, it is advised to use this field only when the\n data pointed by this field persists in an entire lifetime of the\n connection."]
    pub user_data: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngtcp2_path"][::std::mem::size_of::<ngtcp2_path>() - 40usize];
    ["Alignment of ngtcp2_path"][::std::mem::align_of::<ngtcp2_path>() - 8usize];
    ["Offset of field: ngtcp2_path::local"][::std::mem::offset_of!(ngtcp2_path, local) - 0usize];
    ["Offset of field: ngtcp2_path::remote"][::std::mem::offset_of!(ngtcp2_path, remote) - 16usize];
    ["Offset of field: ngtcp2_path::user_data"]
        [::std::mem::offset_of!(ngtcp2_path, user_data) - 32usize];
};
impl Default for ngtcp2_path {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @struct\n\n :type:`ngtcp2_crypto_md` is a wrapper around native message digest\n object."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngtcp2_crypto_md {
    #[doc = " :member:`native_handle` is a pointer to an underlying message\n digest object."]
    pub native_handle: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngtcp2_crypto_md"][::std::mem::size_of::<ngtcp2_crypto_md>() - 8usize];
    ["Alignment of ngtcp2_crypto_md"][::std::mem::align_of::<ngtcp2_crypto_md>() - 8usize];
    ["Offset of field: ngtcp2_crypto_md::native_handle"]
        [::std::mem::offset_of!(ngtcp2_crypto_md, native_handle) - 0usize];
};
impl Default for ngtcp2_crypto_md {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @struct\n\n :type:`ngtcp2_crypto_aead` is a wrapper around native AEAD object."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngtcp2_crypto_aead {
    #[doc = " :member:`native_handle` is a pointer to an underlying AEAD\n object."]
    pub native_handle: *mut ::std::os::raw::c_void,
    #[doc = " :member:`max_overhead` is the number of additional bytes which\n AEAD encryption needs on encryption."]
    pub max_overhead: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngtcp2_crypto_aead"][::std::mem::size_of::<ngtcp2_crypto_aead>() - 16usize];
    ["Alignment of ngtcp2_crypto_aead"][::std::mem::align_of::<ngtcp2_crypto_aead>() - 8usize];
    ["Offset of field: ngtcp2_crypto_aead::native_handle"]
        [::std::mem::offset_of!(ngtcp2_crypto_aead, native_handle) - 0usize];
    ["Offset of field: ngtcp2_crypto_aead::max_overhead"]
        [::std::mem::offset_of!(ngtcp2_crypto_aead, max_overhead) - 8usize];
};
impl Default for ngtcp2_crypto_aead {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @struct\n\n :type:`ngtcp2_crypto_cipher` is a wrapper around native cipher\n object."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngtcp2_crypto_cipher {
    #[doc = " :member:`native_handle` is a pointer to an underlying cipher\n object."]
    pub native_handle: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngtcp2_crypto_cipher"][::std::mem::size_of::<ngtcp2_crypto_cipher>() - 8usize];
    ["Alignment of ngtcp2_crypto_cipher"][::std::mem::align_of::<ngtcp2_crypto_cipher>() - 8usize];
    ["Offset of field: ngtcp2_crypto_cipher::native_handle"]
        [::std::mem::offset_of!(ngtcp2_crypto_cipher, native_handle) - 0usize];
};
impl Default for ngtcp2_crypto_cipher {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @struct\n\n :type:`ngtcp2_crypto_aead_ctx` is a wrapper around native AEAD\n cipher context object.  It should be initialized with a specific\n key.  ngtcp2 library reuses this context object to encrypt or\n decrypt multiple packets."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngtcp2_crypto_aead_ctx {
    #[doc = " :member:`native_handle` is a pointer to an underlying AEAD\n context object."]
    pub native_handle: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngtcp2_crypto_aead_ctx"][::std::mem::size_of::<ngtcp2_crypto_aead_ctx>() - 8usize];
    ["Alignment of ngtcp2_crypto_aead_ctx"]
        [::std::mem::align_of::<ngtcp2_crypto_aead_ctx>() - 8usize];
    ["Offset of field: ngtcp2_crypto_aead_ctx::native_handle"]
        [::std::mem::offset_of!(ngtcp2_crypto_aead_ctx, native_handle) - 0usize];
};
impl Default for ngtcp2_crypto_aead_ctx {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @struct\n\n :type:`ngtcp2_crypto_cipher_ctx` is a wrapper around native cipher\n context object.  It should be initialized with a specific key.\n ngtcp2 library reuses this context object to encrypt or decrypt\n multiple packet headers."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngtcp2_crypto_cipher_ctx {
    #[doc = " :member:`native_handle` is a pointer to an underlying cipher\n context object."]
    pub native_handle: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngtcp2_crypto_cipher_ctx"]
        [::std::mem::size_of::<ngtcp2_crypto_cipher_ctx>() - 8usize];
    ["Alignment of ngtcp2_crypto_cipher_ctx"]
        [::std::mem::align_of::<ngtcp2_crypto_cipher_ctx>() - 8usize];
    ["Offset of field: ngtcp2_crypto_cipher_ctx::native_handle"]
        [::std::mem::offset_of!(ngtcp2_crypto_cipher_ctx, native_handle) - 0usize];
};
impl Default for ngtcp2_crypto_cipher_ctx {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @struct\n\n :type:`ngtcp2_crypto_ctx` is a convenient structure to bind all\n crypto related objects in one place.  Use\n `ngtcp2_crypto_ctx_initial` to initialize this struct for Initial\n packet encryption.  For Handshake and 1RTT packets, use\n `ngtcp2_crypto_ctx_tls`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngtcp2_crypto_ctx {
    #[doc = " :member:`aead` is AEAD object."]
    pub aead: ngtcp2_crypto_aead,
    #[doc = " :member:`md` is message digest object."]
    pub md: ngtcp2_crypto_md,
    #[doc = " :member:`hp` is header protection cipher."]
    pub hp: ngtcp2_crypto_cipher,
    #[doc = " :member:`max_encryption` is the number of encryption which this\n key can be used with."]
    pub max_encryption: u64,
    #[doc = " :member:`max_decryption_failure` is the number of decryption\n failure with this key."]
    pub max_decryption_failure: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngtcp2_crypto_ctx"][::std::mem::size_of::<ngtcp2_crypto_ctx>() - 48usize];
    ["Alignment of ngtcp2_crypto_ctx"][::std::mem::align_of::<ngtcp2_crypto_ctx>() - 8usize];
    ["Offset of field: ngtcp2_crypto_ctx::aead"]
        [::std::mem::offset_of!(ngtcp2_crypto_ctx, aead) - 0usize];
    ["Offset of field: ngtcp2_crypto_ctx::md"]
        [::std::mem::offset_of!(ngtcp2_crypto_ctx, md) - 16usize];
    ["Offset of field: ngtcp2_crypto_ctx::hp"]
        [::std::mem::offset_of!(ngtcp2_crypto_ctx, hp) - 24usize];
    ["Offset of field: ngtcp2_crypto_ctx::max_encryption"]
        [::std::mem::offset_of!(ngtcp2_crypto_ctx, max_encryption) - 32usize];
    ["Offset of field: ngtcp2_crypto_ctx::max_decryption_failure"]
        [::std::mem::offset_of!(ngtcp2_crypto_ctx, max_decryption_failure) - 40usize];
};
impl Default for ngtcp2_crypto_ctx {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " @struct\n\n :type:`ngtcp2_version_cid` is a convenient struct to store the\n result of `ngtcp2_pkt_decode_version_cid`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngtcp2_version_cid {
    #[doc = " :member:`version` stores QUIC version."]
    pub version: u32,
    #[doc = " :member:`dcid` points to the Destination Connection ID."]
    pub dcid: *const u8,
    #[doc = " :member:`dcidlen` is the length of the Destination Connection ID\n pointed by :member:`dcid`."]
    pub dcidlen: usize,
    #[doc = " :member:`scid` points to the Source Connection ID."]
    pub scid: *const u8,
    #[doc = " :member:`scidlen` is the length of the Source Connection ID\n pointed by :member:`scid`."]
    pub scidlen: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngtcp2_version_cid"][::std::mem::size_of::<ngtcp2_version_cid>() - 40usize];
    ["Alignment of ngtcp2_version_cid"][::std::mem::align_of::<ngtcp2_version_cid>() - 8usize];
    ["Offset of field: ngtcp2_version_cid::version"]
        [::std::mem::offset_of!(ngtcp2_version_cid, version) - 0usize];
    ["Offset of field: ngtcp2_version_cid::dcid"]
        [::std::mem::offset_of!(ngtcp2_version_cid, dcid) - 8usize];
    ["Offset of field: ngtcp2_version_cid::dcidlen"]
        [::std::mem::offset_of!(ngtcp2_version_cid, dcidlen) - 16usize];
    ["Offset of field: ngtcp2_version_cid::scid"]
        [::std::mem::offset_of!(ngtcp2_version_cid, scid) - 24usize];
    ["Offset of field: ngtcp2_version_cid::scidlen"]
        [::std::mem::offset_of!(ngtcp2_version_cid, scidlen) - 32usize];
};
impl Default for ngtcp2_version_cid {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngtcp2_conn {
    _unused: [u8; 0],
}
#[doc = " @functypedef\n\n :type:`ngtcp2_client_initial` is invoked when client application\n asks TLS stack to produce first TLS cryptographic handshake data.\n\n This implementation of this callback must get the first handshake\n data from TLS stack and pass it to ngtcp2 library using\n `ngtcp2_conn_submit_crypto_data` function.  Make sure that before\n calling `ngtcp2_conn_submit_crypto_data` function, client\n application must create initial packet protection keys and IVs, and\n provide them to ngtcp2 library using\n `ngtcp2_conn_install_initial_key`.\n\n This callback function must return 0 if it succeeds, or\n :macro:`NGTCP2_ERR_CALLBACK_FAILURE` which makes the library call\n return immediately."]
pub type ngtcp2_client_initial = ::std::option::Option<
    unsafe extern "C" fn(
        conn: *mut ngtcp2_conn,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " @functypedef\n\n :type:`ngtcp2_recv_client_initial` is invoked when server receives\n Initial packet from client.  An server application must implement\n this callback, and generate initial keys and IVs for both\n transmission and reception.  Install them using\n `ngtcp2_conn_install_initial_key`.  |dcid| is the destination\n connection ID which client generated randomly.  It is used to\n derive initial packet protection keys.\n\n The callback function must return 0 if it succeeds.  If an error\n occurs, return :macro:`NGTCP2_ERR_CALLBACK_FAILURE` which makes the\n library call return immediately."]
pub type ngtcp2_recv_client_initial = ::std::option::Option<
    unsafe extern "C" fn(
        conn: *mut ngtcp2_conn,
        dcid: *const ngtcp2_cid,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " :enum:`NGTCP2_CRYPTO_LEVEL_INITIAL` is Initial Keys encryption\n level."]
pub const ngtcp2_crypto_level_NGTCP2_CRYPTO_LEVEL_INITIAL: ngtcp2_crypto_level = 0;
#[doc = " :enum:`NGTCP2_CRYPTO_LEVEL_HANDSHAKE` is Handshake Keys\n encryption level."]
pub const ngtcp2_crypto_level_NGTCP2_CRYPTO_LEVEL_HANDSHAKE: ngtcp2_crypto_level = 1;
#[doc = " :enum:`NGTCP2_CRYPTO_LEVEL_APPLICATION` is Application Data\n (1-RTT) Keys encryption level."]
pub const ngtcp2_crypto_level_NGTCP2_CRYPTO_LEVEL_APPLICATION: ngtcp2_crypto_level = 2;
#[doc = " :enum:`NGTCP2_CRYPTO_LEVEL_EARLY` is Early Data (0-RTT) Keys\n encryption level."]
pub const ngtcp2_crypto_level_NGTCP2_CRYPTO_LEVEL_EARLY: ngtcp2_crypto_level = 3;
#[doc = " @enum\n\n :type:`ngtcp2_crypto_level` is encryption level."]
pub type ngtcp2_crypto_level = ::std::os::raw::c_uint;
#[doc = " @functypedef\n\n :type`ngtcp2_recv_crypto_data` is invoked when crypto data is\n received.  The received data is pointed to by |data|, and its\n length is |datalen|.  The |offset| specifies the offset where\n |data| is positioned.  |user_data| is the arbitrary pointer passed\n to `ngtcp2_conn_client_new` or `ngtcp2_conn_server_new`.  The\n ngtcp2 library ensures that the crypto data is passed to the\n application in the increasing order of |offset|.  |datalen| is\n always strictly greater than 0.  |crypto_level| indicates the\n encryption level where this data is received.  Crypto data can\n never be received in\n :enum:`ngtcp2_crypto_level.NGTCP2_CRYPTO_LEVEL_EARLY`.\n\n The application should provide the given data to TLS stack.\n\n The callback function must return 0 if it succeeds, or one of the\n following negative error codes:\n\n - :macro:`NGTCP2_ERR_CRYPTO`\n - :macro:`NGTCP2_ERR_REQUIRED_TRANSPORT_PARAM`\n - :macro:`NGTCP2_ERR_MALFORMED_TRANSPORT_PARAM`\n - :macro:`NGTCP2_ERR_TRANSPORT_PARAM`\n - :macro:`NGTCP2_ERR_PROTO`\n - :macro:`NGTCP2_ERR_VERSION_NEGOTIATION_FAILURE`\n - :macro:`NGTCP2_ERR_NOMEM`\n - :macro:`NGTCP2_ERR_CALLBACK_FAILURE`\n\n If the other value is returned, it is treated as\n :macro:`NGTCP2_ERR_CALLBACK_FAILURE`.\n\n If application encounters fatal error, return\n :macro:`NGTCP2_ERR_CALLBACK_FAILURE` which makes the library call\n return immediately."]
pub type ngtcp2_recv_crypto_data = ::std::option::Option<
    unsafe extern "C" fn(
        conn: *mut ngtcp2_conn,
        crypto_level: ngtcp2_crypto_level,
        offset: u64,
        data: *const u8,
        datalen: usize,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " @functypedef\n\n :type:`ngtcp2_handshake_completed` is invoked when QUIC\n cryptographic handshake has completed.\n\n The callback function must return 0 if it succeeds.  Returning\n :macro:`NGTCP2_ERR_CALLBACK_FAILURE` makes the library call return\n immediately."]
pub type ngtcp2_handshake_completed = ::std::option::Option<
    unsafe extern "C" fn(
        conn: *mut ngtcp2_conn,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " @functypedef\n\n :type:`ngtcp2_handshake_confirmed` is invoked when QUIC\n cryptographic handshake is confirmed.  The handshake confirmation\n means that both endpoints agree that handshake has finished.\n\n The callback function must return 0 if it succeeds.  Returning\n :macro:`NGTCP2_ERR_CALLBACK_FAILURE` makes the library call return\n immediately."]
pub type ngtcp2_handshake_confirmed = ::std::option::Option<
    unsafe extern "C" fn(
        conn: *mut ngtcp2_conn,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " @functypedef\n\n :type:`ngtcp2_recv_version_negotiation` is invoked when Version\n Negotiation packet is received.  |hd| is the pointer to the QUIC\n packet header object.  The vector |sv| of |nsv| elements contains\n the QUIC version the server supports.  Since Version Negotiation is\n only sent by server, this callback function is used by client only.\n\n The callback function must return 0 if it succeeds, or\n :macro:`NGTCP2_ERR_CALLBACK_FAILURE` which makes the library call\n return immediately."]
pub type ngtcp2_recv_version_negotiation = ::std::option::Option<
    unsafe extern "C" fn(
        conn: *mut ngtcp2_conn,
        hd: *const ngtcp2_pkt_hd,
        sv: *const u32,
        nsv: usize,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " @functypedef\n\n :type:`ngtcp2_recv_retry` is invoked when Retry packet is received.\n This callback is client use only.\n\n Application must regenerate packet protection key, IV, and header\n protection key for Initial packets using the destination connection\n ID obtained by :member:`hd->scid <ngtcp2_pkt_hd.scid>` and install\n them by calling `ngtcp2_conn_install_initial_key()`.\n\n 0-RTT data accepted by the ngtcp2 library will be automatically\n retransmitted as 0-RTT data by the library.\n\n The callback function must return 0 if it succeeds.  Returning\n :macro:`NGTCP2_ERR_CALLBACK_FAILURE` makes the library call return\n immediately."]
pub type ngtcp2_recv_retry = ::std::option::Option<
    unsafe extern "C" fn(
        conn: *mut ngtcp2_conn,
        hd: *const ngtcp2_pkt_hd,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " @functypedef\n\n :type:`ngtcp2_encrypt` is invoked when the ngtcp2 library asks the\n application to encrypt packet payload.  The packet payload to\n encrypt is passed as |plaintext| of length |plaintextlen|.  The\n AEAD cipher is |aead|.  |aead_ctx| is the AEAD cipher context\n object which is initialized with encryption key.  The nonce is\n passed as |nonce| of length |noncelen|.  The Additional\n Authenticated Data is passed as |aad| of length |aadlen|.\n\n The implementation of this callback must encrypt |plaintext| using\n the negotiated cipher suite and write the ciphertext into the\n buffer pointed by |dest|.  |dest| has enough capacity to store the\n ciphertext and any additional AEAD tag data.\n\n |dest| and |plaintext| may point to the same buffer.\n\n The callback function must return 0 if it succeeds, or\n :macro:`NGTCP2_ERR_CALLBACK_FAILURE` which makes the library call\n return immediately."]
pub type ngtcp2_encrypt = ::std::option::Option<
    unsafe extern "C" fn(
        dest: *mut u8,
        aead: *const ngtcp2_crypto_aead,
        aead_ctx: *const ngtcp2_crypto_aead_ctx,
        plaintext: *const u8,
        plaintextlen: usize,
        nonce: *const u8,
        noncelen: usize,
        aad: *const u8,
        aadlen: usize,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " @functypedef\n\n :type:`ngtcp2_decrypt` is invoked when the ngtcp2 library asks the\n application to decrypt packet payload.  The packet payload to\n decrypt is passed as |ciphertext| of length |ciphertextlen|.  The\n AEAD cipher is |aead|.  |aead_ctx| is the AEAD cipher context\n object which is initialized with decryption key.  The nonce is\n passed as |nonce| of length |noncelen|.  The Additional\n Authenticated Data is passed as |aad| of length |aadlen|.\n\n The implementation of this callback must decrypt |ciphertext| using\n the negotiated cipher suite and write the ciphertext into the\n buffer pointed by |dest|.  |dest| has enough capacity to store the\n cleartext.\n\n |dest| and |ciphertext| may point to the same buffer.\n\n The callback function must return 0 if it succeeds.  If TLS stack\n fails to decrypt data, return :macro:`NGTCP2_ERR_DECRYPT`.  For any\n other errors, return :macro:`NGTCP2_ERR_CALLBACK_FAILURE` which\n makes the library call return immediately."]
pub type ngtcp2_decrypt = ::std::option::Option<
    unsafe extern "C" fn(
        dest: *mut u8,
        aead: *const ngtcp2_crypto_aead,
        aead_ctx: *const ngtcp2_crypto_aead_ctx,
        ciphertext: *const u8,
        ciphertextlen: usize,
        nonce: *const u8,
        noncelen: usize,
        aad: *const u8,
        aadlen: usize,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " @functypedef\n\n :type:`ngtcp2_hp_mask` is invoked when the ngtcp2 library asks the\n application to produce a mask to encrypt or decrypt packet header.\n The encryption cipher is |hp|.  |hp_ctx| is the cipher context\n object which is initialized with header protection key.  The sample\n is passed as |sample| which is :macro:`NGTCP2_HP_SAMPLELEN` bytes\n long.\n\n The implementation of this callback must produce a mask using the\n header protection cipher suite specified by QUIC specification and\n write the result into the buffer pointed by |dest|.  The length of\n the mask must be at least :macro:`NGTCP2_HP_MASKLEN`.  The library\n only uses the first :macro:`NGTCP2_HP_MASKLEN` bytes of the\n produced mask.  The buffer pointed by |dest| is guaranteed to have\n at least :macro:`NGTCP2_HP_SAMPLELEN` bytes available for\n convenience.\n\n The callback function must return 0 if it succeeds, or\n :macro:`NGTCP2_ERR_CALLBACK_FAILURE` which makes the library call\n return immediately."]
pub type ngtcp2_hp_mask = ::std::option::Option<
    unsafe extern "C" fn(
        dest: *mut u8,
        hp: *const ngtcp2_crypto_cipher,
        hp_ctx: *const ngtcp2_crypto_cipher_ctx,
        sample: *const u8,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " @functypedef\n\n :type:`ngtcp2_recv_stream_data` is invoked when stream data is\n received.  The stream is specified by |stream_id|.  |flags| is the\n bitwise-OR of zero or more of :macro:`NGTCP2_STREAM_DATA_FLAG_*\n <NGTCP2_STREAM_DATA_FLAG_NONE>`.  If |flags| &\n :macro:`NGTCP2_STREAM_DATA_FLAG_FIN` is nonzero, this portion of\n the data is the last data in this stream.  |offset| is the offset\n where this data begins.  The library ensures that data is passed to\n the application in the non-decreasing order of |offset| without any\n overlap.  The data is passed as |data| of length |datalen|.\n |datalen| may be 0 if and only if |fin| is nonzero.\n\n If :macro:`NGTCP2_STREAM_DATA_FLAG_EARLY` is set in |flags|, it\n indicates that a part of or whole data was received in 0RTT packet\n and a handshake has not completed yet.\n\n The callback function must return 0 if it succeeds, or\n :macro:`NGTCP2_ERR_CALLBACK_FAILURE` which makes the library return\n immediately."]
pub type ngtcp2_recv_stream_data = ::std::option::Option<
    unsafe extern "C" fn(
        conn: *mut ngtcp2_conn,
        flags: u32,
        stream_id: i64,
        offset: u64,
        data: *const u8,
        datalen: usize,
        user_data: *mut ::std::os::raw::c_void,
        stream_user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " @functypedef\n\n :type:`ngtcp2_stream_open` is a callback function which is called\n when remote stream is opened by peer.  This function is not called\n if stream is opened by implicitly (we might reconsider this\n behaviour).\n\n The implementation of this callback should return 0 if it succeeds.\n Returning :macro:`NGTCP2_ERR_CALLBACK_FAILURE` makes the library\n call return immediately."]
pub type ngtcp2_stream_open = ::std::option::Option<
    unsafe extern "C" fn(
        conn: *mut ngtcp2_conn,
        stream_id: i64,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " @functypedef\n\n :type:`ngtcp2_stream_close` is invoked when a stream is closed.\n This callback is not called when QUIC connection is closed before\n existing streams are closed.  |flags| is the bitwise-OR of zero or\n more of :macro:`NGTCP2_STREAM_CLOSE_FLAG_*\n <NGTCP2_STREAM_CLOSE_FLAG_NONE>`.  |app_error_code| indicates the\n error code of this closure if\n :macro:`NGTCP2_STREAM_CLOSE_FLAG_APP_ERROR_CODE_SET` is set in\n |flags|.  If it is not set, the stream was closed without any error\n code, which generally means success.\n\n |app_error_code| is the first application error code sent by a\n local endpoint, or received from a remote endpoint.  If a stream is\n closed cleanly, no application error code is exchanged.  Since QUIC\n stack does not know the application error code which indicates \"no\n errors\", |app_error_code| is set to 0 and\n :macro:`NGTCP2_STREAM_CLOSE_FLAG_APP_ERROR_CODE_SET` is not set in\n |flags| in this case.\n\n The implementation of this callback should return 0 if it succeeds.\n Returning :macro:`NGTCP2_ERR_CALLBACK_FAILURE` makes the library\n call return immediately."]
pub type ngtcp2_stream_close = ::std::option::Option<
    unsafe extern "C" fn(
        conn: *mut ngtcp2_conn,
        flags: u32,
        stream_id: i64,
        app_error_code: u64,
        user_data: *mut ::std::os::raw::c_void,
        stream_user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " @functypedef\n\n :type:`ngtcp2_stream_reset` is invoked when a stream identified by\n |stream_id| is reset by a remote endpoint.\n\n The implementation of this callback should return 0 if it succeeds.\n Returning :macro:`NGTCP2_ERR_CALLBACK_FAILURE` makes the library\n call return immediately."]
pub type ngtcp2_stream_reset = ::std::option::Option<
    unsafe extern "C" fn(
        conn: *mut ngtcp2_conn,
        stream_id: i64,
        final_size: u64,
        app_error_code: u64,
        user_data: *mut ::std::os::raw::c_void,
        stream_user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " @functypedef\n\n :type:`ngtcp2_acked_stream_data_offset` is a callback function\n which is called when stream data is acked, and application can free\n the data.  The acked range of data is [offset, offset + datalen).\n For a given stream_id, this callback is called sequentially in\n increasing order of |offset| without any overlap.  |datalen| is\n normally strictly greater than 0.  One exception is that when a\n packet which includes STREAM frame which has fin flag set, and 0\n length data, this callback is invoked with 0 passed as |datalen|.\n\n If a stream is closed prematurely and stream data is still\n in-flight, this callback function is not called for those data.\n\n The implementation of this callback should return 0 if it succeeds.\n Returning :macro:`NGTCP2_ERR_CALLBACK_FAILURE` makes the library\n call return immediately."]
pub type ngtcp2_acked_stream_data_offset = ::std::option::Option<
    unsafe extern "C" fn(
        conn: *mut ngtcp2_conn,
        stream_id: i64,
        offset: u64,
        datalen: u64,
        user_data: *mut ::std::os::raw::c_void,
        stream_user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " @functypedef\n\n :type:`ngtcp2_recv_stateless_reset` is a callback function which is\n called when Stateless Reset packet is received.  The stateless\n reset details are given in |sr|.\n\n The implementation of this callback should return 0 if it succeeds.\n Returning :macro:`NGTCP2_ERR_CALLBACK_FAILURE` makes the library\n call return immediately."]
pub type ngtcp2_recv_stateless_reset = ::std::option::Option<
    unsafe extern "C" fn(
        conn: *mut ngtcp2_conn,
        sr: *const ngtcp2_pkt_stateless_reset,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " @functypedef\n\n :type:`ngtcp2_extend_max_streams` is a callback function which is\n called every time max stream ID is strictly extended.\n |max_streams| is the cumulative number of streams which an endpoint\n can open.\n\n The callback function must return 0 if it succeeds.  Returning\n :macro:`NGTCP2_ERR_CALLBACK_FAILURE` makes the library call return\n immediately."]
pub type ngtcp2_extend_max_streams = ::std::option::Option<
    unsafe extern "C" fn(
        conn: *mut ngtcp2_conn,
        max_streams: u64,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " @functypedef\n\n :type:`ngtcp2_extend_max_stream_data` is a callback function which\n is invoked when max stream data is extended.  |stream_id|\n identifies the stream.  |max_data| is a cumulative number of bytes\n the endpoint can send on this stream.\n\n The callback function must return 0 if it succeeds.  Returning\n :macro:`NGTCP2_ERR_CALLBACK_FAILURE` makes the library call return\n immediately."]
pub type ngtcp2_extend_max_stream_data = ::std::option::Option<
    unsafe extern "C" fn(
        conn: *mut ngtcp2_conn,
        stream_id: i64,
        max_data: u64,
        user_data: *mut ::std::os::raw::c_void,
        stream_user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " @functypedef\n\n :type:`ngtcp2_rand` is a callback function to get randomized byte\n string from application.  Application must fill random |destlen|\n bytes to the buffer pointed by |dest|.  The generated bytes are\n used only in non-cryptographic context."]
pub type ngtcp2_rand = ::std::option::Option<
    unsafe extern "C" fn(dest: *mut u8, destlen: usize, rand_ctx: *const ngtcp2_rand_ctx),
>;
#[doc = " @functypedef\n\n :type:`ngtcp2_get_new_connection_id` is a callback function to ask\n an application for new connection ID.  Application must generate\n new unused connection ID with the exact |cidlen| bytes and store it\n in |cid|.  It also has to generate stateless reset token into\n |token|.  The length of stateless reset token is\n :macro:`NGTCP2_STATELESS_RESET_TOKENLEN` and it is guaranteed that\n the buffer pointed by |cid| has the sufficient space to store the\n token.\n\n The callback function must return 0 if it succeeds.  Returning\n :macro:`NGTCP2_ERR_CALLBACK_FAILURE` makes the library call return\n immediately."]
pub type ngtcp2_get_new_connection_id = ::std::option::Option<
    unsafe extern "C" fn(
        conn: *mut ngtcp2_conn,
        cid: *mut ngtcp2_cid,
        token: *mut u8,
        cidlen: usize,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " @functypedef\n\n :type:`ngtcp2_remove_connection_id` is a callback function which\n notifies the application that connection ID |cid| is no longer used\n by remote endpoint.\n\n The callback function must return 0 if it succeeds.  Returning\n :macro:`NGTCP2_ERR_CALLBACK_FAILURE` makes the library call return\n immediately."]
pub type ngtcp2_remove_connection_id = ::std::option::Option<
    unsafe extern "C" fn(
        conn: *mut ngtcp2_conn,
        cid: *const ngtcp2_cid,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " @functypedef\n\n :type:`ngtcp2_update_key` is a callback function which tells the\n application that it must generate new packet protection keying\n materials and AEAD cipher context objects with new keys.  The\n current set of secrets are given as |current_rx_secret| and\n |current_tx_secret| of length |secretlen|.  They are decryption and\n encryption secrets respectively.\n\n The application has to generate new secrets and keys for both\n encryption and decryption, and write decryption secret and IV to\n the buffer pointed by |rx_secret| and |rx_iv| respectively.  It\n also has to create new AEAD cipher context object with new\n decryption key and initialize |rx_aead_ctx| with it.  Similarly,\n write encryption secret and IV to the buffer pointed by |tx_secret|\n and |tx_iv|.  Create new AEAD cipher context object with new\n encryption key and initialize |tx_aead_ctx| with it.  All given\n buffers have the enough capacity to store secret, key and IV.\n\n The callback function must return 0 if it succeeds.  Returning\n :macro:`NGTCP2_ERR_CALLBACK_FAILURE` makes the library call return\n immediately."]
pub type ngtcp2_update_key = ::std::option::Option<
    unsafe extern "C" fn(
        conn: *mut ngtcp2_conn,
        rx_secret: *mut u8,
        tx_secret: *mut u8,
        rx_aead_ctx: *mut ngtcp2_crypto_aead_ctx,
        rx_iv: *mut u8,
        tx_aead_ctx: *mut ngtcp2_crypto_aead_ctx,
        tx_iv: *mut u8,
        current_rx_secret: *const u8,
        current_tx_secret: *const u8,
        secretlen: usize,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " @functypedef\n\n :type:`ngtcp2_path_validation` is a callback function which tells\n the application the outcome of path validation.  |flags| is zero or\n more of :macro:`NGTCP2_PATH_VALIDATION_FLAG_*\n <NGTCP2_PATH_VALIDATION_FLAG_NONE>`.  |path| is the path that was\n validated.  If |res| is\n :enum:`ngtcp2_path_validation_result.NGTCP2_PATH_VALIDATION_RESULT_SUCCESS`,\n the path validation succeeded.  If |res| is\n :enum:`ngtcp2_path_validation_result.NGTCP2_PATH_VALIDATION_RESULT_FAILURE`,\n the path validation failed.\n\n The callback function must return 0 if it succeeds.  Returning\n :macro:`NGTCP2_ERR_CALLBACK_FAILURE` makes the library call return\n immediately."]
pub type ngtcp2_path_validation = ::std::option::Option<
    unsafe extern "C" fn(
        conn: *mut ngtcp2_conn,
        flags: u32,
        path: *const ngtcp2_path,
        res: ngtcp2_path_validation_result,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " @functypedef\n\n :type:`ngtcp2_select_preferred_addr` is a callback function which\n asks a client application to choose server address from preferred\n addresses |paddr| received from server.  An application should\n write a network path for a selected preferred address in |dest|.\n More specifically, the selected preferred address must be set to\n :member:`dest->remote <ngtcp2_path.remote>`, a client source\n address must be set to :member:`dest->local <ngtcp2_path.local>`.\n If a client source address does not change for the new server\n address, leave :member:`dest->local <ngtcp2_path.local>`\n unmodified, or copy the value of :member:`local\n <ngtcp2_path.local>` field of the current network path obtained\n from `ngtcp2_conn_get_path()`.  Both :member:`dest->local.addr\n <ngtcp2_addr.addr>` and :member:`dest->remote.addr\n <ngtcp2_addr.addr>` point to buffers which are at least\n ``sizeof(struct sockaddr_storage)`` bytes long, respectively.  If\n an application denies the preferred addresses, just leave |dest|\n unmodified (or set :member:`dest->remote.addrlen\n <ngtcp2_addr.addrlen>` to 0) and return 0.\n\n The callback function must return 0 if it succeeds.  Returning\n :macro:`NGTCP2_ERR_CALLBACK_FAILURE` makes the library call return\n immediately."]
pub type ngtcp2_select_preferred_addr = ::std::option::Option<
    unsafe extern "C" fn(
        conn: *mut ngtcp2_conn,
        dest: *mut ngtcp2_path,
        paddr: *const ngtcp2_preferred_addr,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " @functypedef\n\n :type:`ngtcp2_connection_id_status` is a callback function which is\n called when the status of Connection ID changes.\n\n |token| is the associated stateless reset token and it is ``NULL``\n if no token is present.\n\n |type| is the one of the value defined in\n :type:`ngtcp2_connection_id_status_type`.  The new value might be\n added in the future release.\n\n The callback function must return 0 if it succeeds.  Returning\n :macro:`NGTCP2_ERR_CALLBACK_FAILURE` makes the library call return\n immediately."]
pub type ngtcp2_connection_id_status = ::std::option::Option<
    unsafe extern "C" fn(
        conn: *mut ngtcp2_conn,
        type_: ::std::os::raw::c_int,
        seq: u64,
        cid: *const ngtcp2_cid,
        token: *const u8,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " @functypedef\n\n :type:`ngtcp2_recv_new_token` is a callback function which is\n called when new token is received from server.\n\n |token| is the received token.\n\n The callback function must return 0 if it succeeds.  Returning\n :macro:`NGTCP2_ERR_CALLBACK_FAILURE` makes the library call return\n immediately."]
pub type ngtcp2_recv_new_token = ::std::option::Option<
    unsafe extern "C" fn(
        conn: *mut ngtcp2_conn,
        token: *const ngtcp2_vec,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " @functypedef\n\n :type:`ngtcp2_delete_crypto_aead_ctx` is a callback function which\n must delete the native object pointed by\n :member:`aead_ctx->native_handle\n <ngtcp2_crypto_aead_ctx.native_handle>`."]
pub type ngtcp2_delete_crypto_aead_ctx = ::std::option::Option<
    unsafe extern "C" fn(
        conn: *mut ngtcp2_conn,
        aead_ctx: *mut ngtcp2_crypto_aead_ctx,
        user_data: *mut ::std::os::raw::c_void,
    ),
>;
#[doc = " @functypedef\n\n :type:`ngtcp2_delete_crypto_cipher_ctx` is a callback function\n which must delete the native object pointed by\n :member:`cipher_ctx->native_handle\n <ngtcp2_crypto_cipher_ctx.native_handle>`."]
pub type ngtcp2_delete_crypto_cipher_ctx = ::std::option::Option<
    unsafe extern "C" fn(
        conn: *mut ngtcp2_conn,
        cipher_ctx: *mut ngtcp2_crypto_cipher_ctx,
        user_data: *mut ::std::os::raw::c_void,
    ),
>;
#[doc = " @functypedef\n\n :type:`ngtcp2_recv_datagram` is invoked when DATAGRAM frame is\n received.  |flags| is bitwise-OR of zero or more of\n :macro:`NGTCP2_DATAGRAM_FLAG_* <NGTCP2_DATAGRAM_FLAG_NONE>`.\n\n If :macro:`NGTCP2_DATAGRAM_FLAG_EARLY` is set in |flags|, it\n indicates that DATAGRAM frame was received in 0RTT packet and a\n handshake has not completed yet.\n\n The callback function must return 0 if it succeeds, or\n :macro:`NGTCP2_ERR_CALLBACK_FAILURE` which makes the library return\n immediately."]
pub type ngtcp2_recv_datagram = ::std::option::Option<
    unsafe extern "C" fn(
        conn: *mut ngtcp2_conn,
        flags: u32,
        data: *const u8,
        datalen: usize,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " @functypedef\n\n :type:`ngtcp2_ack_datagram` is invoked when a packet which contains\n DATAGRAM frame which is identified by |dgram_id| is acknowledged.\n |dgram_id| is the valued passed to `ngtcp2_conn_writev_datagram`.\n\n The callback function must return 0 if it succeeds, or\n :macro:`NGTCP2_ERR_CALLBACK_FAILURE` which makes the library return\n immediately."]
pub type ngtcp2_ack_datagram = ::std::option::Option<
    unsafe extern "C" fn(
        conn: *mut ngtcp2_conn,
        dgram_id: u64,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " @functypedef\n\n :type:`ngtcp2_lost_datagram` is invoked when a packet which\n contains DATAGRAM frame which is identified by |dgram_id| is\n declared lost.  |dgram_id| is the valued passed to\n `ngtcp2_conn_writev_datagram`.  Note that the loss might be\n spurious, and DATAGRAM frame might be acknowledged later.\n\n The callback function must return 0 if it succeeds, or\n :macro:`NGTCP2_ERR_CALLBACK_FAILURE` which makes the library return\n immediately."]
pub type ngtcp2_lost_datagram = ::std::option::Option<
    unsafe extern "C" fn(
        conn: *mut ngtcp2_conn,
        dgram_id: u64,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " @functypedef\n\n :type:`ngtcp2_get_path_challenge_data` is a callback function to\n ask an application for new data that is sent in PATH_CHALLENGE\n frame.  Application must generate new unpredictable exactly\n :macro:`NGTCP2_PATH_CHALLENGE_DATALEN` bytes of random data and\n store them into the buffer pointed by |data|.\n\n The callback function must return 0 if it succeeds.  Returning\n :macro:`NGTCP2_ERR_CALLBACK_FAILURE` makes the library call return\n immediately."]
pub type ngtcp2_get_path_challenge_data = ::std::option::Option<
    unsafe extern "C" fn(
        conn: *mut ngtcp2_conn,
        data: *mut u8,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " @functypedef\n\n :type:`ngtcp2_stream_stop_sending` is invoked when a stream is no\n longer read by a local endpoint before it receives all stream data.\n This function is called at most once per stream.  |app_error_code|\n is the error code passed to `ngtcp2_conn_shutdown_stream_read` or\n `ngtcp2_conn_shutdown_stream`.\n\n The callback function must return 0 if it succeeds.  Returning\n :macro:`NGTCP2_ERR_CALLBACK_FAILURE` makes the library call return\n immediately."]
pub type ngtcp2_stream_stop_sending = ::std::option::Option<
    unsafe extern "C" fn(
        conn: *mut ngtcp2_conn,
        stream_id: i64,
        app_error_code: u64,
        user_data: *mut ::std::os::raw::c_void,
        stream_user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " @functypedef\n\n :type:`ngtcp2_version_negotiation` is invoked when the compatible\n version negotiation takes place.  For client, it is called when it\n sees a change in version field of a long header packet.  This\n callback function might be called multiple times for client.  For\n server, it is called once when the version is negotiated.\n\n The implementation of this callback must install new Initial keys\n for |version|.  Use `ngtcp2_conn_install_vneg_initial_key` to\n install keys.\n\n The callback function must return 0 if it succeeds.  Returning\n :macro:`NGTCP2_ERR_CALLBACK_FAILURE` makes the library call return\n immediately."]
pub type ngtcp2_version_negotiation = ::std::option::Option<
    unsafe extern "C" fn(
        conn: *mut ngtcp2_conn,
        version: u32,
        client_dcid: *const ngtcp2_cid,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " @functypedef\n\n :type:`ngtcp2_recv_key` is invoked when new key is installed to\n |conn| during QUIC cryptographic handshake.\n\n The callback function must return 0 if it succeeds.  Returning\n :macro:`NGTCP2_ERR_CALLBACK_FAILURE` makes the library call return\n immediately."]
pub type ngtcp2_recv_key = ::std::option::Option<
    unsafe extern "C" fn(
        conn: *mut ngtcp2_conn,
        level: ngtcp2_crypto_level,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " @functypedef\n\n :type:`ngtcp2_early_data_rejected` is invoked when early data was\n rejected by server, or client decided not to attempt early data.\n\n The callback function must return 0 if it succeeds.  Returning\n :macro:`NGTCP2_ERR_CALLBACK_FAILURE` makes the library call return\n immediately."]
pub type ngtcp2_early_data_rejected = ::std::option::Option<
    unsafe extern "C" fn(
        conn: *mut ngtcp2_conn,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " @struct\n\n :type:`ngtcp2_callbacks` holds a set of callback functions."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ngtcp2_callbacks {
    #[doc = " :member:`client_initial` is a callback function which is invoked\n when client asks TLS stack to produce first TLS cryptographic\n handshake message.  This callback function must be specified for\n a client application."]
    pub client_initial: ngtcp2_client_initial,
    #[doc = " :member:`recv_client_initial` is a callback function which is\n invoked when a server receives the first packet from client.\n This callback function must be specified for a server application."]
    pub recv_client_initial: ngtcp2_recv_client_initial,
    #[doc = " :member:`recv_crypto_data` is a callback function which is\n invoked when cryptographic data (CRYPTO frame, in other words,\n TLS message) is received.  This callback function must be\n specified."]
    pub recv_crypto_data: ngtcp2_recv_crypto_data,
    #[doc = " :member:`handshake_completed` is a callback function which is\n invoked when QUIC cryptographic handshake has completed.  This\n callback function is optional."]
    pub handshake_completed: ngtcp2_handshake_completed,
    #[doc = " :member:`recv_version_negotiation` is a callback function which\n is invoked when Version Negotiation packet is received by a\n client.  This callback function is optional."]
    pub recv_version_negotiation: ngtcp2_recv_version_negotiation,
    #[doc = " :member:`encrypt` is a callback function which is invoked to\n encrypt a QUIC packet.  This callback function must be specified."]
    pub encrypt: ngtcp2_encrypt,
    #[doc = " :member:`decrypt` is a callback function which is invoked to\n decrypt a QUIC packet.  This callback function must be specified."]
    pub decrypt: ngtcp2_decrypt,
    #[doc = " :member:`hp_mask` is a callback function which is invoked to get\n a mask to encrypt or decrypt packet header.  This callback\n function must be specified."]
    pub hp_mask: ngtcp2_hp_mask,
    #[doc = " :member:`recv_stream_data` is a callback function which is\n invoked when STREAM data, which includes application data, is\n received.  This callback function is optional."]
    pub recv_stream_data: ngtcp2_recv_stream_data,
    #[doc = " :member:`acked_stream_data_offset` is a callback function which\n is invoked when STREAM data, which includes application data, is\n acknowledged by a remote endpoint.  It tells an application the\n largest offset of acknowledged STREAM data without a gap so that\n application can free memory for the data.  This callback function\n is optional."]
    pub acked_stream_data_offset: ngtcp2_acked_stream_data_offset,
    #[doc = " :member:`stream_open` is a callback function which is invoked\n when new remote stream is opened by a remote endpoint.  This\n callback function is optional."]
    pub stream_open: ngtcp2_stream_open,
    #[doc = " :member:`stream_close` is a callback function which is invoked\n when a stream is closed.  This callback function is optional."]
    pub stream_close: ngtcp2_stream_close,
    #[doc = " :member:`recv_stateless_reset` is a callback function which is\n invoked when Stateless Reset packet is received.  This callback\n function is optional."]
    pub recv_stateless_reset: ngtcp2_recv_stateless_reset,
    #[doc = " :member:`recv_retry` is a callback function which is invoked when\n a client receives Retry packet.  For client, this callback\n function must be specified.  Server never receive Retry packet."]
    pub recv_retry: ngtcp2_recv_retry,
    #[doc = " :member:`extend_max_local_streams_bidi` is a callback function\n which is invoked when the number of bidirectional stream which a\n local endpoint can open is increased.  This callback function is\n optional."]
    pub extend_max_local_streams_bidi: ngtcp2_extend_max_streams,
    #[doc = " :member:`extend_max_local_streams_uni` is a callback function\n which is invoked when the number of unidirectional stream which a\n local endpoint can open is increased.  This callback function is\n optional."]
    pub extend_max_local_streams_uni: ngtcp2_extend_max_streams,
    #[doc = " :member:`rand` is a callback function which is invoked when the\n library needs sequence of random data.  This callback function\n must be specified."]
    pub rand: ngtcp2_rand,
    #[doc = " :member:`get_new_connection_id` is a callback function which is\n invoked when the library needs new connection ID.  This callback\n function must be specified."]
    pub get_new_connection_id: ngtcp2_get_new_connection_id,
    #[doc = " :member:`remove_connection_id` is a callback function which\n notifies an application that connection ID is no longer used by a\n remote endpoint.  This callback function is optional."]
    pub remove_connection_id: ngtcp2_remove_connection_id,
    #[doc = " :member:`update_key` is a callback function which is invoked when\n the library tells an application that it must update keying\n materials and install new keys.  This callback function must be\n specified."]
    pub update_key: ngtcp2_update_key,
    #[doc = " :member:`path_validation` is a callback function which is invoked\n when path validation completed.  This callback function is\n optional."]
    pub path_validation: ngtcp2_path_validation,
    #[doc = " :member:`select_preferred_addr` is a callback function which is\n invoked when the library asks a client to select preferred\n address presented by a server.  This callback function is\n optional."]
    pub select_preferred_addr: ngtcp2_select_preferred_addr,
    #[doc = " :member:`stream_reset` is a callback function which is invoked\n when a stream is reset by a remote endpoint.  This callback\n function is optional."]
    pub stream_reset: ngtcp2_stream_reset,
    #[doc = " :member:`extend_max_remote_streams_bidi` is a callback function\n which is invoked when the number of bidirectional streams which a\n remote endpoint can open is increased.  This callback function is\n optional."]
    pub extend_max_remote_streams_bidi: ngtcp2_extend_max_streams,
    #[doc = " :member:`extend_max_remote_streams_uni` is a callback function\n which is invoked when the number of unidirectional streams which\n a remote endpoint can open is increased.  This callback function\n is optional."]
    pub extend_max_remote_streams_uni: ngtcp2_extend_max_streams,
    #[doc = " :member:`extend_max_stream_data` is callback function which is\n invoked when the maximum offset of STREAM data that a local\n endpoint can send is increased.  This callback function is\n optional."]
    pub extend_max_stream_data: ngtcp2_extend_max_stream_data,
    #[doc = " :member:`dcid_status` is a callback function which is invoked\n when the new destination Connection ID is activated or the\n activated destination Connection ID is now deactivated.  This\n callback function is optional."]
    pub dcid_status: ngtcp2_connection_id_status,
    #[doc = " :member:`handshake_confirmed` is a callback function which is\n invoked when both endpoints agree that handshake has finished.\n This field is ignored by server because handshake_completed\n indicates the handshake confirmation for server.  This callback\n function is optional."]
    pub handshake_confirmed: ngtcp2_handshake_confirmed,
    #[doc = " :member:`recv_new_token` is a callback function which is invoked\n when new token is received from server.  This field is ignored by\n server.  This callback function is optional."]
    pub recv_new_token: ngtcp2_recv_new_token,
    #[doc = " :member:`delete_crypto_aead_ctx` is a callback function which\n deletes a given AEAD cipher context object.  This callback\n function must be specified."]
    pub delete_crypto_aead_ctx: ngtcp2_delete_crypto_aead_ctx,
    #[doc = " :member:`delete_crypto_cipher_ctx` is a callback function which\n deletes a given cipher context object.  This callback function\n must be specified."]
    pub delete_crypto_cipher_ctx: ngtcp2_delete_crypto_cipher_ctx,
    #[doc = " :member:`recv_datagram` is a callback function which is invoked\n when DATAGRAM frame is received.  This callback function is\n optional."]
    pub recv_datagram: ngtcp2_recv_datagram,
    #[doc = " :member:`ack_datagram` is a callback function which is invoked\n when a packet containing DATAGRAM frame is acknowledged.  This\n callback function is optional."]
    pub ack_datagram: ngtcp2_ack_datagram,
    #[doc = " :member:`lost_datagram` is a callback function which is invoked\n when a packet containing DATAGRAM frame is declared lost.  This\n callback function is optional."]
    pub lost_datagram: ngtcp2_lost_datagram,
    #[doc = " :member:`get_path_challenge_data` is a callback function which is\n invoked when the library needs new PATH_CHALLENGE data.  This\n callback must be specified."]
    pub get_path_challenge_data: ngtcp2_get_path_challenge_data,
    #[doc = " :member:`stream_stop_sending` is a callback function which is\n invoked when a local endpoint no longer reads from a stream\n before it receives all stream data.  This callback function is\n optional."]
    pub stream_stop_sending: ngtcp2_stream_stop_sending,
    #[doc = " :member:`version_negotiation` is a callback function which is\n invoked when the compatible version negotiation takes place.\n This callback function must be specified."]
    pub version_negotiation: ngtcp2_version_negotiation,
    #[doc = " :member:`recv_rx_key` is a callback function which is invoked\n when a new key for decrypting packets is installed during QUIC\n cryptographic handshake.  It is not called for\n :enum:`ngtcp2_crypto_level.NGTCP2_CRYPTO_LEVEL_INITIAL`."]
    pub recv_rx_key: ngtcp2_recv_key,
    #[doc = " :member:`recv_tx_key` is a callback function which is invoked\n when a new key for encrypting packets is installed during QUIC\n cryptographic handshake.  It is not called for\n :enum:`ngtcp2_crypto_level.NGTCP2_CRYPTO_LEVEL_INITIAL`."]
    pub recv_tx_key: ngtcp2_recv_key,
    #[doc = " :member:`ngtcp2_early_data_rejected` is a callback function which\n is invoked when an attempt to send early data by client was\n rejected by server, or client decided not to attempt early data.\n This callback function is only used by client."]
    pub early_data_rejected: ngtcp2_early_data_rejected,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngtcp2_callbacks"][::std::mem::size_of::<ngtcp2_callbacks>() - 320usize];
    ["Alignment of ngtcp2_callbacks"][::std::mem::align_of::<ngtcp2_callbacks>() - 8usize];
    ["Offset of field: ngtcp2_callbacks::client_initial"]
        [::std::mem::offset_of!(ngtcp2_callbacks, client_initial) - 0usize];
    ["Offset of field: ngtcp2_callbacks::recv_client_initial"]
        [::std::mem::offset_of!(ngtcp2_callbacks, recv_client_initial) - 8usize];
    ["Offset of field: ngtcp2_callbacks::recv_crypto_data"]
        [::std::mem::offset_of!(ngtcp2_callbacks, recv_crypto_data) - 16usize];
    ["Offset of field: ngtcp2_callbacks::handshake_completed"]
        [::std::mem::offset_of!(ngtcp2_callbacks, handshake_completed) - 24usize];
    ["Offset of field: ngtcp2_callbacks::recv_version_negotiation"]
        [::std::mem::offset_of!(ngtcp2_callbacks, recv_version_negotiation) - 32usize];
    ["Offset of field: ngtcp2_callbacks::encrypt"]
        [::std::mem::offset_of!(ngtcp2_callbacks, encrypt) - 40usize];
    ["Offset of field: ngtcp2_callbacks::decrypt"]
        [::std::mem::offset_of!(ngtcp2_callbacks, decrypt) - 48usize];
    ["Offset of field: ngtcp2_callbacks::hp_mask"]
        [::std::mem::offset_of!(ngtcp2_callbacks, hp_mask) - 56usize];
    ["Offset of field: ngtcp2_callbacks::recv_stream_data"]
        [::std::mem::offset_of!(ngtcp2_callbacks, recv_stream_data) - 64usize];
    ["Offset of field: ngtcp2_callbacks::acked_stream_data_offset"]
        [::std::mem::offset_of!(ngtcp2_callbacks, acked_stream_data_offset) - 72usize];
    ["Offset of field: ngtcp2_callbacks::stream_open"]
        [::std::mem::offset_of!(ngtcp2_callbacks, stream_open) - 80usize];
    ["Offset of field: ngtcp2_callbacks::stream_close"]
        [::std::mem::offset_of!(ngtcp2_callbacks, stream_close) - 88usize];
    ["Offset of field: ngtcp2_callbacks::recv_stateless_reset"]
        [::std::mem::offset_of!(ngtcp2_callbacks, recv_stateless_reset) - 96usize];
    ["Offset of field: ngtcp2_callbacks::recv_retry"]
        [::std::mem::offset_of!(ngtcp2_callbacks, recv_retry) - 104usize];
    ["Offset of field: ngtcp2_callbacks::extend_max_local_streams_bidi"]
        [::std::mem::offset_of!(ngtcp2_callbacks, extend_max_local_streams_bidi) - 112usize];
    ["Offset of field: ngtcp2_callbacks::extend_max_local_streams_uni"]
        [::std::mem::offset_of!(ngtcp2_callbacks, extend_max_local_streams_uni) - 120usize];
    ["Offset of field: ngtcp2_callbacks::rand"]
        [::std::mem::offset_of!(ngtcp2_callbacks, rand) - 128usize];
    ["Offset of field: ngtcp2_callbacks::get_new_connection_id"]
        [::std::mem::offset_of!(ngtcp2_callbacks, get_new_connection_id) - 136usize];
    ["Offset of field: ngtcp2_callbacks::remove_connection_id"]
        [::std::mem::offset_of!(ngtcp2_callbacks, remove_connection_id) - 144usize];
    ["Offset of field: ngtcp2_callbacks::update_key"]
        [::std::mem::offset_of!(ngtcp2_callbacks, update_key) - 152usize];
    ["Offset of field: ngtcp2_callbacks::path_validation"]
        [::std::mem::offset_of!(ngtcp2_callbacks, path_validation) - 160usize];
    ["Offset of field: ngtcp2_callbacks::select_preferred_addr"]
        [::std::mem::offset_of!(ngtcp2_callbacks, select_preferred_addr) - 168usize];
    ["Offset of field: ngtcp2_callbacks::stream_reset"]
        [::std::mem::offset_of!(ngtcp2_callbacks, stream_reset) - 176usize];
    ["Offset of field: ngtcp2_callbacks::extend_max_remote_streams_bidi"]
        [::std::mem::offset_of!(ngtcp2_callbacks, extend_max_remote_streams_bidi) - 184usize];
    ["Offset of field: ngtcp2_callbacks::extend_max_remote_streams_uni"]
        [::std::mem::offset_of!(ngtcp2_callbacks, extend_max_remote_streams_uni) - 192usize];
    ["Offset of field: ngtcp2_callbacks::extend_max_stream_data"]
        [::std::mem::offset_of!(ngtcp2_callbacks, extend_max_stream_data) - 200usize];
    ["Offset of field: ngtcp2_callbacks::dcid_status"]
        [::std::mem::offset_of!(ngtcp2_callbacks, dcid_status) - 208usize];
    ["Offset of field: ngtcp2_callbacks::handshake_confirmed"]
        [::std::mem::offset_of!(ngtcp2_callbacks, handshake_confirmed) - 216usize];
    ["Offset of field: ngtcp2_callbacks::recv_new_token"]
        [::std::mem::offset_of!(ngtcp2_callbacks, recv_new_token) - 224usize];
    ["Offset of field: ngtcp2_callbacks::delete_crypto_aead_ctx"]
        [::std::mem::offset_of!(ngtcp2_callbacks, delete_crypto_aead_ctx) - 232usize];
    ["Offset of field: ngtcp2_callbacks::delete_crypto_cipher_ctx"]
        [::std::mem::offset_of!(ngtcp2_callbacks, delete_crypto_cipher_ctx) - 240usize];
    ["Offset of field: ngtcp2_callbacks::recv_datagram"]
        [::std::mem::offset_of!(ngtcp2_callbacks, recv_datagram) - 248usize];
    ["Offset of field: ngtcp2_callbacks::ack_datagram"]
        [::std::mem::offset_of!(ngtcp2_callbacks, ack_datagram) - 256usize];
    ["Offset of field: ngtcp2_callbacks::lost_datagram"]
        [::std::mem::offset_of!(ngtcp2_callbacks, lost_datagram) - 264usize];
    ["Offset of field: ngtcp2_callbacks::get_path_challenge_data"]
        [::std::mem::offset_of!(ngtcp2_callbacks, get_path_challenge_data) - 272usize];
    ["Offset of field: ngtcp2_callbacks::stream_stop_sending"]
        [::std::mem::offset_of!(ngtcp2_callbacks, stream_stop_sending) - 280usize];
    ["Offset of field: ngtcp2_callbacks::version_negotiation"]
        [::std::mem::offset_of!(ngtcp2_callbacks, version_negotiation) - 288usize];
    ["Offset of field: ngtcp2_callbacks::recv_rx_key"]
        [::std::mem::offset_of!(ngtcp2_callbacks, recv_rx_key) - 296usize];
    ["Offset of field: ngtcp2_callbacks::recv_tx_key"]
        [::std::mem::offset_of!(ngtcp2_callbacks, recv_tx_key) - 304usize];
    ["Offset of field: ngtcp2_callbacks::early_data_rejected"]
        [::std::mem::offset_of!(ngtcp2_callbacks, early_data_rejected) - 312usize];
};
#[doc = " :enum:`NGTCP2_CONNECTION_CLOSE_ERROR_CODE_TYPE_TRANSPORT`\n indicates the error code is QUIC transport error code."]
pub const ngtcp2_connection_close_error_code_type_NGTCP2_CONNECTION_CLOSE_ERROR_CODE_TYPE_TRANSPORT : ngtcp2_connection_close_error_code_type = 0 ;
#[doc = " :enum:`NGTCP2_CONNECTION_CLOSE_ERROR_CODE_TYPE_APPLICATION`\n indicates the error code is application error code."]
pub const ngtcp2_connection_close_error_code_type_NGTCP2_CONNECTION_CLOSE_ERROR_CODE_TYPE_APPLICATION : ngtcp2_connection_close_error_code_type = 1 ;
#[doc = " :enum:`NGTCP2_CONNECTION_CLOSE_ERROR_CODE_TYPE_TRANSPORT_VERSION_NEGOTIATION`\n is a special case of QUIC transport error, and it indicates that\n client receives Version Negotiation packet."]
pub const ngtcp2_connection_close_error_code_type_NGTCP2_CONNECTION_CLOSE_ERROR_CODE_TYPE_TRANSPORT_VERSION_NEGOTIATION : ngtcp2_connection_close_error_code_type = 2 ;
#[doc = " :enum:`NGTCP2_CONNECTION_CLOSE_ERROR_CODE_TYPE_TRANSPORT_IDLE_CLOSE`\n is a special case of QUIC transport error, and it indicates that\n connection is closed because of idle timeout."]
pub const ngtcp2_connection_close_error_code_type_NGTCP2_CONNECTION_CLOSE_ERROR_CODE_TYPE_TRANSPORT_IDLE_CLOSE : ngtcp2_connection_close_error_code_type = 3 ;
#[doc = " @enum\n\n :type:`ngtcp2_connection_close_error_code_type` defines connection\n error code type."]
pub type ngtcp2_connection_close_error_code_type = ::std::os::raw::c_uint;
#[doc = " @struct\n\n :type:`ngtcp2_connection_close_error` contains connection\n error code, its type, and the optional reason phrase."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ngtcp2_connection_close_error {
    #[doc = " :member:`type` is the type of :member:`error_code`."]
    pub type_: ngtcp2_connection_close_error_code_type,
    #[doc = " :member:`error_code` is the error code for connection closure."]
    pub error_code: u64,
    #[doc = " :member:`frame_type` is the type of QUIC frame which triggers\n this connection error.  This field is set to 0 if the frame type\n is unknown."]
    pub frame_type: u64,
    #[doc = " :member:`reason` points to the buffer which contains a reason\n phrase.  It may be NULL if there is no reason phrase.  If it is\n received from a remote endpoint, it is truncated to at most 1024\n bytes."]
    pub reason: *mut u8,
    #[doc = " :member:`reasonlen` is the length of data pointed by\n :member:`reason`."]
    pub reasonlen: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ngtcp2_connection_close_error"]
        [::std::mem::size_of::<ngtcp2_connection_close_error>() - 40usize];
    ["Alignment of ngtcp2_connection_close_error"]
        [::std::mem::align_of::<ngtcp2_connection_close_error>() - 8usize];
    ["Offset of field: ngtcp2_connection_close_error::type_"]
        [::std::mem::offset_of!(ngtcp2_connection_close_error, type_) - 0usize];
    ["Offset of field: ngtcp2_connection_close_error::error_code"]
        [::std::mem::offset_of!(ngtcp2_connection_close_error, error_code) - 8usize];
    ["Offset of field: ngtcp2_connection_close_error::frame_type"]
        [::std::mem::offset_of!(ngtcp2_connection_close_error, frame_type) - 16usize];
    ["Offset of field: ngtcp2_connection_close_error::reason"]
        [::std::mem::offset_of!(ngtcp2_connection_close_error, reason) - 24usize];
    ["Offset of field: ngtcp2_connection_close_error::reasonlen"]
        [::std::mem::offset_of!(ngtcp2_connection_close_error, reasonlen) - 32usize];
};
impl Default for ngtcp2_connection_close_error {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
